{
  "personalInfo": {
    "name": "Dr Renu Dhir",
    "institution": "Dr B R Ambedkar National Institute of Technology Jalandhar",
    "department": "Computer Science and Engineering",
    "role": "Professor",
    "startDate": "",
    "endDate": "present",
    "url": "https://scholar.google.com/citations?view_op=medium_photo&user=kPU1jkQAAAAJ",
    "careerSpan": ""
  },
  "metrics": {
    "citations": {
      "total": 1936,
      "h_index": 25,
      "i10_index": 63
    },
    "yearWiseCitations": {},
    "averagePerItem": 11.66,
    "averagePerYear": 1936.0,
    "timesCited": 1936,
    "dedupedTimesCited": 1936,
    "activeYears": 0
  },
  "researchFields": [
    {
      "name": "Image Processing",
      "url": "/research_field/image_processing"
    },
    {
      "name": "Pattern Recognition",
      "url": "/research_field/pattern_recognition"
    },
    {
      "name": "Information Security",
      "url": "/research_field/information_security"
    }
  ],
  "publications": [
    {
      "title": "Handwritten Gurmukhi character recognition using statistical and background directional distribution",
      "year": "",
      "authors": "Kartar Singh Siddharth and Mahesh Jangid and Renu Dhir and Rajneesh Rani",
      "citations": 87,
      "journal": "Int. J. Comput. Sci. Eng.(IJCSE)",
      "abstract": "In this manuscript handwritten Gurmukhi character recognition for isolated characters is proposed. We have used some statistical features like zonal density, projection histograms (horizontal, vertical and both diagonal), distance profiles (from left, right, top and bottom sides). In addition, we have used background directional distribution (BDD) features. Our database consists of 200 samples of each of basic 35 characters of Gurmukhi script collected from different writers. These samples are pre-processed and normalized to 32* 32 sizes. SVM, K-NN and PNN classifiers are used for classification. The performance comparison of features used in different combination with different classifiers is presented and analysed. The highest accuracy obtained is 95.04% as 5-fold cross validation of whole database using zonal density and background distribution features in combination with SVM classifier used with RBF kernel.",
      "url": "https://www.academia.edu/download/31185428/doaj.pdf",
      "citationUrl": "/scholar?hl=en&cites=564916409944980036"
    },
    {
      "title": "A frequent concepts based document clustering algorithm",
      "year": "",
      "authors": "Rekha Baghel and Renu Dhir",
      "citations": 87,
      "journal": "International Journal of Computer Applications",
      "abstract": "This paper presents a novel technique of document clustering based on frequent concepts. The proposed technique, FCDC (Frequent Concepts based document clustering), a clustering algorithm works with frequent concepts rather than frequent items used in traditional text mining techniques. Many well known clustering algorithms deal with documents as bag of words and ignore the important relationships between words like synonyms. the proposed FCDC algorithm utilizes the semantic relationship between words to create concepts. It exploits the WordNet ontology in turn to create low dimensional feature vector which allows us to develop a efficient clustering algorithm. It uses a hierarchical approach to cluster text documents having common concepts. FCDC found more accurate, scalable and effective when compared with existing clustering algorithms like Bisecting K-means, UPGMA and FIHC.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=249e56d09eb5c5df5799088f7a2b0b38eeb03cc5",
      "citationUrl": "/scholar?hl=en&cites=13826961257308586576"
    },
    {
      "title": "Opinion mining of news headlines using SentiWordNet",
      "year": "",
      "authors": "Apoorv Agarwal and Vivek Sharma and Geeta Sikka and Renu Dhir",
      "citations": 67,
      "journal": "",
      "abstract": "Opinion Mining (also known as “Sentiment Analysis”) is an area of text classification which continuously gives its contribution in research field. The main objective of Opinion mining is Sentiment Classification i.e. to classify the opinion into positive or negative classes. SentiWordNet is an opinion lexicon derived from the WordNet database where each term is associated with some numerical scores indicating positive and negative sentiment information. Up until recently most researchers presented opinion mining of online user generated data like reviews, blogs, comments, articles etc. Opinion mining for offline user generated data like newspaper is unconcerned so far despite the fact that it is also explored by many users. As a first step, this paper present opinion mining for newspaper headlines using SentiWordNet. Further, most of the researchers implement the opinion mining by separating out the adverb-adjective …",
      "url": "https://ieeexplore.ieee.org/abstract/document/7570949/",
      "citationUrl": "/scholar?hl=en&cites=6473247874291620252"
    },
    {
      "title": "A new image steganography based on first component alteration technique",
      "year": "",
      "authors": "Amanpreet Kaur and Renu Dhir and Geeta Sikka",
      "citations": 64,
      "journal": "arXiv preprint arXiv:1001.1972",
      "abstract": "In this paper, A new image steganography scheme is proposed which is a kind of spatial domain technique. In order to hide secret data in cover-image, the first component alteration technique is used. Techniques used so far focuses only on the two or four bits of a pixel in a image (at the most five bits at the edge of an image) which results in less peak to signal noise ratio and high root mean square error. In this technique, 8 bits of blue components of pixels are replaced with secret data bits. Proposed scheme can embed more data than previous schemes and shows better image quality. To prove this scheme, several experiments are performed, and are compared the experimental results with the related previous works.",
      "url": "https://arxiv.org/abs/1001.1972",
      "citationUrl": "/scholar?hl=en&cites=16246628374729859490"
    },
    {
      "title": "Handwritten Devanagari character recognition using gradient features",
      "year": "",
      "authors": "Ashutosh Aggarwal and Rajneesh Rani and Renu Dhir",
      "citations": 62,
      "journal": "International Journal of Advanced Research in Computer Science and Software Engineering",
      "abstract": "",
      "url": "https://scholar.google.com/scholar?cluster=12856220682615403579&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=12856220682615403579"
    },
    {
      "title": "Use of Gabor Filters for recognition of Handwritten Gurmukhi character",
      "year": "",
      "authors": "Sukhpreet Singh and Ashutosh Aggarwal and Renu Dhir",
      "citations": 50,
      "journal": "International Journal of Advanced Research in Computer Science and Software Engineering",
      "abstract": "In this manuscript handwritten Gurmukhi character recognition for isolated characters is proposed. We have used Gabor Filter based method for feature extraction. Our database consists of 200 samples of each of basic 35 characters of Gurmukhi script collected from different writers. These samples are pre-processed and normalized to 32* 32 sizes. The highest accuracy obtained is 94.29% as 5-fold cross validation of whole database with SVM classifier used with RBF kernel.",
      "url": "https://www.researchgate.net/profile/Ashutosh-Aggarwal/publication/267944005_Use_of_Gabor_Filters_for_Recognition_of_Handwritten_Gurmukhi_Character/links/55a60ee208ae00cf99c9985f/Use-of-Gabor-Filters-for-Recognition-of-Handwritten-Gurmukhi-Character.pdf",
      "citationUrl": "/scholar?hl=en&cites=5379600070217961680"
    },
    {
      "title": "Land use land cover classification of remote sensing images based on the deep learning approaches: a statistical analysis and review",
      "year": "",
      "authors": "Monia Digra and Renu Dhir and Nonita Sharma",
      "citations": 48,
      "journal": "",
      "abstract": "Over the last few years, deep learning (DL) techniques have gained popularity and have become the new standard for data processing in remote sensing analysis. Deep learning architectures have drawn significant attention due to their improved performance in a variety of segmentation, classification, and other machine vision applications. In remote sensing, land use and land cover (LULC) are critical components of a wide variety of environmental applications. Changes in land use on a spatial and temporal scale occur due to accuracy, the capacity to develop, flexibility, uncertainty, structure, and the capability to integrate available models. Therefore, LULC modeling’s high performance demands the employment of a wide variety of model types in remote sensing, which include dynamic, statistical, and DL models. In this study, we first analysed several key findings and research gaps in traditional technology while …",
      "url": "https://link.springer.com/article/10.1007/s12517-022-10246-8",
      "citationUrl": "/scholar?hl=en&cites=9334999627382275289"
    },
    {
      "title": "A review of metaphase chromosome image selection techniques for automatic karyotype generation",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 45,
      "journal": "",
      "abstract": "The karyotype is analyzed to detect the genetic abnormalities. It is generated by arranging the chromosomes after extracting them from the metaphase chromosome images. The chromosomes are non-rigid bodies that contain the genetic information of an individual. The metaphase chromosome image spread contains the chromosomes, but these chromosomes are not distinct bodies; they can either be individual chromosomes or be touching one another; they may be bent or even may be overlapping and thus forming a cluster of chromosomes. The extraction of chromosomes from these touching and overlapping chromosomes is a very tedious process.  The segmentation of a random metaphase chromosome image may not give us correct and accurate results. Therefore, before taking up a metaphase chromosome image for analysis, it must be analyzed for the orientation of the chromosomes it contains …",
      "url": "https://link.springer.com/article/10.1007/s11517-015-1419-z",
      "citationUrl": "/scholar?hl=en&cites=14131902102749915476"
    },
    {
      "title": "A study of ad hoc network: A review",
      "year": "",
      "authors": "V Student and Renu Dhir",
      "citations": 45,
      "journal": "",
      "abstract": "This paper focus on the study of Ad Hoc network its protocols and different types of networks in detail, as we know this is an emerging field which places lot of contribution in networking. The concept of dynamic mobility is also introduced in Ad Hoc network because nodes are moving from one place to another place, within this network any node can join the network and can leave the network at any time. Nodes can be the form of systems or devices ie mobile phone, laptop, personal digital assistance, MP3 player and personal computer that are participating in the network and are mobile. At same time these nodes can act as host/router or both. The WiFi IEEE 802.11 and WiMAX IEEE 802.16 wireless standard supports different data rates at the first physical layer. Security and immediate reply of different types of nodes (end to end nodes, intermediate nodes and wireless antenna) is the main concern in AD HOC networks.",
      "url": "http://rakhmadhany.lecture.ub.ac.id/files/2015/03/V3I1-0203.pdf",
      "citationUrl": "/scholar?hl=en&cites=6611638336651484795"
    },
    {
      "title": "Script identification of pre-segmented multi-font characters and digits",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Gurpreet Singh Lehal",
      "citations": 43,
      "journal": "",
      "abstract": "Character recognition problems of distinct scripts have their own script specific characteristics. The state-of-art optical character recognition systems use different methodolgies, to recognize different script characters, which are most effective for the corresponding script. The identificaton of the script of the individual character has not brought much attention between researchers, most of the script identification work is on document, line and word level. In this multilingual/multiscript world presence of different script characters in a single document is very common. We here propose a system to encounter such adverse situation in context of English and Gurumukhi Script. Experiments on multifont and multisized characters with Gabor features based on directional frequency and Gradient features based on gradient information of an individual character to identify it as Gurumukhi or English and also as character or numeral …",
      "url": "https://ieeexplore.ieee.org/abstract/document/6628794/",
      "citationUrl": "/scholar?hl=en&cites=5369838140433656548"
    },
    {
      "title": "Comparative Recognition of Handwritten Gurmukhi Numerals Using Different Feature Sets and Classifiers",
      "year": "",
      "authors": "Kartar Singh Siddharth and Renu Dhir and Rajneesh Rani and M Jangid and K Singh",
      "citations": 41,
      "journal": "International Conference on Recent Advances and Future Trends in Information Technology (iRAFIT2012)",
      "abstract": "Recently there is an emerging trend in the research to recognize handwritten characters and numerals of many Indian languages and scripts. In this manuscript we have practiced the recognition of handwritten Gurmukhi numerals using three feature sets and three classifiers. Among three feature sets, first feature set is comprised of distance profiles having 128 features. Second feature set is comprised of different types of projection histograms having 190 features. Third feature set is comprised of zonal density and Background Directional Distribution (BDD) forming 144 features. The three classifiers used are SVM, PNN and K-NN. The SVM classifier is used with RBF (Radial Basis Function) kernel. We have observed the 5-fold cross validation accuracy in the case of each feature set and classifier. We have obtained the optimized result with each combination of feature set and classifier by adjusting the different parameters. The results are compared and trends of result in each combination of feature set and classifier with varying parameters is also discussed. With PNN and K-NN the highest results are obtained using third feature set as 98.33% and 98.51% respectively while with SVM the highest result is obtained using second feature set as 99.2%. The results with SVM for all feature sets are higher than the results with PNN and K-NN.",
      "url": "https://www.researchgate.net/profile/Kartar-Siddharth/publication/267367611_Comparative_Recognition_of_Handwritten_Gurmukhi_Numerals_Using_Different_Feature_Sets_and_Classifiers/links/5497f57f0cf20f487d31eca9/Comparative-Recognition-of-Handwritten-Gurmukhi-Numerals-Using-Different-Feature-Sets-and-Classifiers.pdf",
      "citationUrl": "/scholar?hl=en&cites=14762062450661766276"
    },
    {
      "title": "An intelligent and energy-efficient wireless body area network to control coronavirus outbreak",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 39,
      "journal": "Arabian Journal for Science and Engineering",
      "abstract": "The coronaviruses are a deadly family of epidemic viruses that can spread from one individual to another very quickly, infecting masses. The literature on epidemics indicates that the early diagnosis of a coronavirus infection can lead to a reduction in mortality rates. To prevent coronavirus disease 2019 (COVID-19) from spreading, the regular identification and monitoring of infected patients are needed. In this regard, wireless body area networks (WBANs) can be used in conjunction with machine learning and the Internet of Things (IoT) to identify and monitor the human body for health-related information, which in turn can aid in the early diagnosis of diseases. This paper proposes a novel coronavirus-body area network (CoV-BAN) model based on IoT technology as a real-time health monitoring system for the detection of the early stages of coronavirus infection using a number of wearable biosensors to …",
      "url": "https://link.springer.com/article/10.1007/s13369-021-05411-2",
      "citationUrl": "/scholar?hl=en&cites=3279828160056685540"
    },
    {
      "title": "A novel approach for segmentation of human metaphase chromosome images using region based active contours.",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 36,
      "journal": "Int. Arab J. Inf. Technol.",
      "abstract": "The chromosomes are the genetic information carries. A healthy human being has 46 chromosomes. Any alteration in either the number of chromosomes or the structure of chromosomes in a human being is diagnosed as a genetic defect. To uncover the genetic defects the metaphase chromosomes are imaged and analyzed. The metaphase chromosome images often contain intensity inhomogeneity that makes the image segmentation task difficult. The difficulties caused by intensity inhomogeneity can be resolved by using region based active contours techniques. These techniques uses the local intensity values of the nearby regions of the objects and find the approximate intensity values along both sides of the contour. In the proposed work a segmentation technique has been proposed to segment the objects present in the human metaphase chromosome images using region based active contours. The proposed technique has been quite efficient from prospective of number of objects segmented. The method has been tested on Advanced Digital Imaging Research (ADIR) dataset. The experimental results have shown quite good performance.",
      "url": "http://ccis2k.org/iajit/PDF/January%202019,%20No.%201/11749.pdf",
      "citationUrl": "/scholar?hl=en&cites=11048489412300429237"
    },
    {
      "title": "Handwritten Hindi text segmentation techniques for lines and characters",
      "year": "",
      "authors": "Saiprakash Palakollu and Renu Dhir and Rajneesh Rani",
      "citations": 36,
      "journal": "Proceedings of the world congress on engineering and computer science",
      "abstract": "This paper mainly deals with the new methods for line segmentation and character segmentation of overlapping characters of Handwritten Hindi text. The text is segmented into lines, lines into words and then from lines words header lines are detected and converted as straight lines. Each word is divided into three parts upper modifier, consonant and lower, so that character segmentation becomes easy. Algorithm is finding the header lines and base lines by estimating the average line height and based on it. This algorithm works efficiently on overlapped characters for different text sizes and different resolutions images.",
      "url": "https://www.iaeng.org/publication/WCECS2012/WCECS2012_pp640-644.pdf",
      "citationUrl": "/scholar?hl=en&cites=2076389865849268002"
    },
    {
      "title": "Brain tumor detection analysis using CNN: a review",
      "year": "",
      "authors": "Sunil Kumar and Renu Dhir and Nisha Chaurasia",
      "citations": 31,
      "journal": "",
      "abstract": "A Brain Tumor is essentially a malformed cell growth that can be cancerous and non-cancerous. The tumor in the Brain is the most dangerous disease and can be diagnosed easily and reliably with the help of detection of the tumor with automated techniques on MRI Images. Several methods of efficient diagnosis and segmentation of brain tumors have been suggested by many researchers for effective tumor detection. A review method involving two-stage approaches for 20 research papers published in the period from 2000 to 2020 has been conducted to learn about tumor detection in MRI images. There has also been a comparative study of various processes. Two key problems are discovered after an intensive analysis procedure, Image Restoration and Image Enhancement. Which are solved and clarified with suitable methodologies. The introduction of quantitative image analysis resulted in fields such as MRI …",
      "url": "https://ieeexplore.ieee.org/abstract/document/9395920/",
      "citationUrl": "/scholar?hl=en&cites=9073945802935401778"
    },
    {
      "title": "Diagonal features and SVM classifier for handwritten Gurumukhi character recognition",
      "year": "",
      "authors": "Anita Jindal and Renu Dhir and Rajneesh Rani",
      "citations": 30,
      "journal": "International Journal of Advanced Research in Computer Science and Software Engineering",
      "abstract": "In this paper an isolated handwritten Gurumukhi character recognition system using SVM classifier is presented. Diagonal features are used for extracting the features of a character. Diagonal feature computation consists of two steps1) character image is divided into different zones2) Diagonal Features are computed for each zone of the character. Features are also computed from each image by considering zones in horizontal and vertical directions. Thus total 120 features are computed for each character. We have used in all 7000 images of Gurumukhi characters for the purpose of training and testing. The proposed system achieves a maximum recognition accuracy of 95.34% and 95.74% using diagonal features and SVM classifier with 5-fold and 10-fold cross validation respectively. The diagonal orientation for feature extraction is identified to be the most suitable method as it yields higher recognition accuracy.",
      "url": "https://www.researchgate.net/profile/Rajneesh-Rani/publication/267367422_Diagonal_Features_and_SVM_Classifier_for_Handwritten_Gurumukhi_Character_Recognition/links/5502fcdb0cf24cee39fd542e/Diagonal-Features-and-SVM-Classifier-for-Handwritten-Gurumukhi-Character-Recognition.pdf",
      "citationUrl": "/scholar?hl=en&cites=867414183717035622"
    },
    {
      "title": "A range free skew detection technique for digitized Gurmukhi script documents",
      "year": "",
      "authors": "GS Lehal and Renu Dhir",
      "citations": 30,
      "journal": "",
      "abstract": "In this paper, a range free skew detection technique for machine printed Gurmukhi documents is presented. This approach can easily be extended to other Indian language scripts such as Devnagri and Bakngla. Most characters in these scripts have horizontal lines at the top called headlines. The characters forming a word are joined at the top by headlines, so that the word appears as one single component with a headline. The ratio of pixel density above and below the headline of any word in Gurmukhi script is always less than 1. These inherent characteristics of the script have been employed and a new algorithm based on the projection profile method has been devised. By inspecting horizontal and vertical projections at different angles in range [0/spl deg/, 90/spl deg/], the skew angle of the document in range [-180/spl deg/, 180/spl deg/] can be determined. Thus this approach is not limited to any range of skew …",
      "url": "https://ieeexplore.ieee.org/abstract/document/791746/",
      "citationUrl": "/scholar?hl=en&cites=12901180480514386001"
    },
    {
      "title": "AHP–neutrosophic decision model for selection of relay node in wireless body area network",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 29,
      "journal": "CAAI Transactions on Intelligence Technology",
      "abstract": "The medical health systems empowered by wireless body area networks (WBANs) are becoming a reliable technology with unmatched facilities for personalised health monitoring and managing real‐time health issues. A WBAN is primarily composed of a miniature, and smart devices called sensors that are worn in, on, or around the human body. In recent years, research has been mainly centred towards the reduction of the energy consumption and stability of the network. The selection of the relay node is one of the foremost issues for balancing the energy consumption in WBAN. To overcome this issue, the authors propose a hybrid analytic hierarchy process–neutrosophic method for making the decision of the relay node selection, in which the analytic hierarchy process (AHP) technique calculates the weights for different criteria and forwards them to the neutrosophic technique which finds out the best alternative …",
      "url": "https://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/trit.2020.0059",
      "citationUrl": "/scholar?hl=en&cites=18161694658285913679"
    },
    {
      "title": "PSOBAN: a novel particle swarm optimization based protocol for wireless body area networks",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 29,
      "journal": "SN Applied Sciences",
      "abstract": "In the modern world, wireless body area networks (WBAN) is projected to play a vital role in biomedical and psychological applications. The practical implementation of WBAN technology surfer from various deployment issues that have to be dealt with. The more serious concern is associated with the energy consumption of these networks. Biosensor nodes continuously sense the signals and send the same to sink. Sending data to sink is an energy-consuming operation, so routing is done to optimize energy utilization in WBAN. The continuous data sensing and the transmission of information over long-distances result in huge energy consumption of these nodes. So, conservation of energy is the need of the hour. The main focus of the current study is to invise a routing mechanism that makes use of particle swarm optimization based on metaheuristic algorithm along with the relay node selection based on …",
      "url": "https://link.springer.com/article/10.1007/s42452-019-1514-0",
      "citationUrl": "/scholar?hl=en&cites=7547769932313488338"
    },
    {
      "title": "A wordsets based document clustering algorithm for large datasets",
      "year": "",
      "authors": "Anuj Sharma and Renu Dhir",
      "citations": 29,
      "journal": "",
      "abstract": "Document clustering is an important tool for applications such as search engines and document browsers. It enables the user to have a good overall view of the information contained in the documents. The well-known methods of document clustering, however, do not really address the special problems of text document clustering: very high dimensionality of the document, very large size of the datasets and understandability of the cluster description. Also there is a strong need of hierarchical document clustering where clustered documents can be browsed according to the increasing specificity of topics. Frequent Itemset Hierarchical Clustering (FIHC) is a novel data mining algorithm for hierarchical grouping of text documents. The approach does not give reliable clustering results when the number of frequent sets of terms is large. In this paper we propose WDC (Wordsets-based Clustering), an efficient clustering …",
      "url": "https://ieeexplore.ieee.org/abstract/document/5397962/",
      "citationUrl": "/scholar?hl=en&cites=8492054820820612367"
    },
    {
      "title": "Natural course of hematogenous pyogenic osteomyelitis (a retrospective study of 110 cases)",
      "year": "",
      "authors": "Y Kharbanda and RS Dhir",
      "citations": 28,
      "journal": "Journal of postgraduate medicine",
      "abstract": "Hundred and ten consecutive cases in acute and various stages of chronicity were studied. Incidence regarding age, sex, bone affected and complications was established. The optimum way to manage osteomyelitis in different stages was sought.",
      "url": "https://journals.lww.com/jopm/fulltext/1991/37020/natural_course_of_hematogenous_pyogenic.2.aspx",
      "citationUrl": "/scholar?hl=en&cites=12054586451908516375"
    },
    {
      "title": "Energy-efficient relay node selection scheme for sustainable wireless body area networks",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 25,
      "journal": "Sustainable Computing: Informatics and Systems",
      "abstract": "Wireless Body Area Networks (WBAN) is one of the recent technology that provides actual-time health status that makes use of the sensors in, on or around the body to ensure the measurement of the biological specifications of the human body. For the long term sustainability of sensor devices, the development of energy-efficient WBAN is one of the major requirement. To deal with this issue, various existing researches have suggested the use of the relay node. The relay node selection can be considered as one of the Multi-Criteria Decision-Making Method (MCDM) problems. In this regard, this paper presents the hybrid version of Analytic Hierarchy Process (AHP) and Technique for Order Preference by Similarity to Ideal Solution (TOPSIS) for the relay node selection problem. On conducting the experiments, in a scenario of WBAN with 10 different nodes. The proposed method shows significant improvement in the …",
      "url": "https://www.sciencedirect.com/science/article/pii/S2210537921000093",
      "citationUrl": "/scholar?hl=en&cites=4156430627906499979"
    },
    {
      "title": "SVM classifier for recognition of handwritten devanagari numeral",
      "year": "",
      "authors": "Mahesh Jangid and Renu Dhir and Rajneesh Rani and Kartar Singh",
      "citations": 25,
      "journal": "",
      "abstract": "In this manuscript we recognize the handwritten Devnagari numerals. In our implementation we have used density and background directional distribution features for the zones, in which we divided the numeral samples already. We used the normalized images of samples of varying sizes of 32*32, 40*40 and 48*48. We divided these normalized images into 4*4 (16), 5*5 (25) and 6*6 (36) zones respectively to compute the features for each zone. In all the cases each zone is of size 8*8 pixels. Each zone contains 9 features consisting of one density feature and 8 backgrounds directional distribution features. The zonal density feature is computed by dividing the number of foreground pixels in each zone by total number of pixels in the zone i.e. 64. The other 8 features are based on directional distribution values of background in eight directions. These directional values are computed for each foreground pixel by …",
      "url": "https://ieeexplore.ieee.org/abstract/document/6108869/",
      "citationUrl": "/scholar?hl=en&cites=9695818149648532273"
    },
    {
      "title": "Performance comparison of devanagari handwritten numerals recognition",
      "year": "",
      "authors": "Mahesh Jangid Kartar Singh and Renu Dhir and Rajneesh Rani",
      "citations": 25,
      "journal": "Int. J. Comput. Appl",
      "abstract": "In this paper an automatic recognition system for isolated Handwritten Devanagari Numerals is proposed and compared the recognition rate with different classifier. We presented a feature extraction technique based on recursive subdivision of the character image so that the resulting sub-images at each iteration have balanced numbers of foreground pixels as possible. Database, provided by Indian Statistical Institute, Kolkata, have 22547 grey scale images written by 1049 persons and obtained 98.98% highest accuracy with SVM classifier. Results are compared with KNN and Quadratic classifier.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=2912f91cc575ae9375e5e2458c78c3e54312845f",
      "citationUrl": "/scholar?hl=en&cites=893058873773641443"
    },
    {
      "title": "Handwritten gurumukhi character recognition using zoning density and background directional distribution features",
      "year": "",
      "authors": "Kartar Singh Siddharth and Renu Dhir and Rajneesh Rani",
      "citations": 25,
      "journal": "International Journal of Computer Science and Information Technologies",
      "abstract": "This paper presents an approach to recognize isolated handwritten Gurumukhi characters. Extracted features used are 16 zonal densities and the 8 background directional distribution features for each of 16 zones. All sample images of Gurumukhi characters used are normalized to 32* 32 pixel sizes. Zoning density is computed by dividing number of foreground pixels in each zone by number of total pixels in the zone. Background directional distribution values are calculated for each foreground pixel by directional distribution of its neighbouring background pixels. The value for each directional distribution is computed by summing up the values specified in a mask for corresponding neighbour background pixels. A specific mask is used in particular direction. These feature values for each direction are summed up for all pixels in each zone. Thus adding 16 zoning density features and 128 background directional distribution features (8 features in each of 16 zones) we used feature vector containing 144 features in our experiment. SVM classifier with RBF kernel is used for classification. We have taken 200 samples of each of 35 basic Gurumukhi characters in our experiment, which are collected from 20 different writers each contributing to write 10 samples of each of 35 characters. Thus we have used total 7000 character samples. By training the classifier with whole dataset we obtained 95.04% 5-fold cross validation accuracy. By using dataset taken by 16 writers (size 5600) to train the system and testing the 1400 samples by another 4 unknown writers to classifier, we obtained 89.14% accuracy. By splitting the handwritten samples of each writer …",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=f732cd4eeaec90100b93b5795be0971abcf84d26",
      "citationUrl": "/scholar?hl=en&cites=1985836183411928205"
    },
    {
      "title": "Correlation-based feature selection and classification via regression of segmented chromosomes using geometric features",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 24,
      "journal": "Medical & biological engineering & computing",
      "abstract": "The genetic defects in the humans are uncovered by studying the chromosomes, as they are the genetic information carriers. They are non-rigid objects and they appear in different orientations when they are imaged. To find out the genetic defects, the chromosomes are pre-processed so that they are not touching, overlapping, and bent, and the noise is also discarded. The presence of bends, overlaps, or touches makes it difficult to uncover the genetic abnormalities. So there is a need for development of an efficient technique to classify the segmented chromosomes into different types and then pre-process them in order to correct their orientation. In this work, a hybrid classification technique based upon correlation-based feature selection and classification via regression approach, which will classify the segmented chromosomes into five categories viz; straight, overlapping, bent, touching, or noise is …",
      "url": "https://link.springer.com/article/10.1007/s11517-016-1553-2",
      "citationUrl": "/scholar?hl=en&cites=18306710795936954123"
    },
    {
      "title": "hPSO-SA: hybrid particle swarm optimization-simulated annealing algorithm for relay node selection in wireless body area networks",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 23,
      "journal": "Applied Intelligence",
      "abstract": "In the modern world, wireless body area networks (WBANs) play an essential role in psychological and biomedical applications. The use of WBANs in medical applications is limited due to various issues related to the sensors, viz., irregularity in data production, replacement and recharging of their batteries and the energy consumed by the networks. This manuscript addresses how these problems can be solved along with optimization of the energy consumption through efficient design of the system by applying routing protocols and heuristic-based optimization algorithms. In this paper, the particle swarm optimization (PSO) algorithm is a heuristic search algorithm that relies on an upgrade mechanism of the velocity and position of swarms. Although PSO has excellent exploration capability in global search, it becomes quickly stuck in local minima. To enhance the local search function of the current PSO …",
      "url": "https://link.springer.com/article/10.1007/s10489-020-01834-w",
      "citationUrl": "/scholar?hl=en&cites=5497120282354451222"
    },
    {
      "title": "A survey on camera-captured scene text detection and extraction: towards Gurmukhi script",
      "year": "",
      "authors": "Amandeep Kaur and Renu Dhir and Gurpreet Singh Lehal",
      "citations": 23,
      "journal": "",
      "abstract": "Owing to technological advancements and new inventions, the world is transforming into a digital world where cameras have replaced the scanners for converting the hard copy documents into their soft versions. And, nowadays, these gadgets are used to capture the images of any text, present anywhere in real-life scenes, and process it, hence making the area of camera-captured scene text extraction a key area of interest for researchers. This paper discusses the certain background concepts and provides a categorization of the major challenges faced while extracting the camera-captured scene text, and scope and applications of the scene text extraction. Moreover, it presents a comprehensive literature survey of different techniques and methods adopted by researchers to extract the text from the scene images captured via cameras with a special emphasis on Gurmukhi script. For better understanding …",
      "url": "https://link.springer.com/article/10.1007/s13735-016-0116-5",
      "citationUrl": "/scholar?hl=en&cites=14931451463615176904"
    },
    {
      "title": "Image compression using fast 2-D DCT technique",
      "year": "",
      "authors": "Anjali Kapoor and Renu Dhir",
      "citations": 23,
      "journal": "International Journal on Computer Science and Engineering",
      "abstract": "Image Compression is a method, which reduces the size of the data to reduce the amount of space required to store the data. The Discrete cosine transform(DCT) is a method for transforms a signal or image from spatial domain to frequency component. It is a widely used technique in image compression. In this paper, we present a lossless discrete cosine transform(DCT) compression technique for two-dimensional images are proposed. In the several scenarios, the utilization of the proposed technique for image compression resulted in comparable or better performance, when compared to the different modes of the lossless JPEG standard.",
      "url": "https://scholar.google.com/scholar?cluster=11141043277935214051&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=11141043277935214051"
    },
    {
      "title": "Recognition of cheising iyek/eeyek-manipuri digits using support vector machines",
      "year": "",
      "authors": "Kansham Angphun Maring and Renu Dhir",
      "citations": 22,
      "journal": "Ijcsit",
      "abstract": "The development of handwriting recognition systems began in the 1950s when there were human operators whose job was to convert data from various documents into electronic format, making the process quite long and often affected by errors. Automatic text recognition aims at limiting these errors by using image pre-processing techniques that increases the speed and precision to the entire recognition process. This paper describes the recognition of Cheising Iyek-Manipuri digits; handwritten as well as printed and comparison of recognition accuracy using Support Vector Machines (SVM). The paper also presents the steps starting right from binarization of scanned images in pre-processing till recognition of the digits using a trained model. Gabor filter-based technique is used for feature extraction. The experiment is carried out with image size 14x10 using MATLAB. An overall accuracy of 89.58% and 98.45% is achieved for handwritten and printed respectively.",
      "url": "https://www.academia.edu/download/37431651/Recognition_of_Cheising_Eeyek_Manipuri_digts_using_SVM.pdf",
      "citationUrl": "/scholar?hl=en&cites=8642778776416631180"
    },
    {
      "title": "Handwritten Gurmukhi numeral recognition using zone-based hybrid feature extraction techniques",
      "year": "",
      "authors": "Gita Sinha and Rajneesh Rani and Renu Dhir",
      "citations": 22,
      "journal": "International Journal of Computer Applications",
      "abstract": "This paper presents an overview of Feature Extraction techniques for off-line recognition of isolated Gurumukhi numerals/characters. Selection of Feature Extraction method is probably the single most important factor in achieving high performance in pattern recognition. Our paper presents Zone based hybrid approach which is the combination of image centroid zone and zone centroid zone of numeral/character image. In image centroid zone character is divided into n equal zone and then image centroid and the average distance from character centroid to each zones/grid/boxes present in image is calculated. Similarly, in zone centroid zone character image is divided into n equal zones and centroid of each zones/boxes/grid and average distance from zone centroid to each pixel present in block/zone/grid is calculated. SVM for subsequent classifier and recognition purpose. Obtaining 99.73% recognition accuracy.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=b1fa49e3521c0cad84f0c38cb4c9f571b2e75196",
      "citationUrl": "/scholar?hl=en&cites=8984527762435826362,14026188910211052898"
    },
    {
      "title": "Performance and evaluation of energy optimization techniques for wireless body area networks",
      "year": "",
      "authors": "Naveen Bilandi and Harsh Kumar Verma and Renu Dhir",
      "citations": 20,
      "journal": "Beni-Suef University Journal of Basic and Applied Sciences",
      "abstract": "Wireless body area networks are created to retrieve and transmit human health information by using sensors on the human body. Energy efficiency is considered a foremost challenge to increase the lifetime of a network. To deal with energy efficiency, one of the important mechanisms is selecting the relay node, which can be modeled as an optimization problem. These days nature-inspired algorithms are being widely used to solve various optimization problems. With regard to this, this paper aims to compare the performance of the three most recent nature-inspired metaheuristic algorithms for solving the relay node selection problem.It has been found that the total energy consumption calculated using grey wolf optimization decreased by 23% as compared to particle swarm optimization and 16% compared to ant lion optimization.The results suggest that grey wolf optimization …",
      "url": "https://link.springer.com/article/10.1186/s43088-020-00064-w",
      "citationUrl": "/scholar?hl=en&cites=9812152554656084403"
    },
    {
      "title": "Software architecture recovery using genetic black hole algorithm",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 19,
      "journal": "ACM SIGSOFT Software Engineering Notes",
      "abstract": "Software clustering is a technique that is used to manage a software system by partitioning it into smaller subsystems containing highly related modules. Search-based software clustering techniques are found to be beneficial in effective partitioning of software systems. In this paper, we propose a search-based technique that is based on a combination of a nature-inspired black-hole algorithm and a genetic algorithm for software clustering. In order to evaluate the success of this approach, it has been applied to some real-world software systems. It is observed that this approach deduces a structure similar to the original architecture of the software system concerned.",
      "url": "https://dl.acm.org/doi/abs/10.1145/2693208.2693230",
      "citationUrl": "/scholar?hl=en&cites=2779464135164679184"
    },
    {
      "title": "Analysis and design of protocol for enhanced threshold proxy signature scheme based on RSA for known signers",
      "year": "",
      "authors": "Raman Kumar and Harsh Kumar Verma and Renu Dhir",
      "citations": 18,
      "journal": "Wireless Personal Communications",
      "abstract": "Many threshold proxy signature schemes are proposed in which the t out of n threshold schemes are deployed; but they still lack the property of security. In this research paper, secret sharing proxy signature could permit the shares of designated signers, called proxy signers, renew their own proxy shares periodically without changing the secret. In particular, our scheme applies the (t, n) threshold proxy signature scheme and allows any t or more then t signers to form a designated group from n proxy signers to sign messages on behalf of the original signer. In the proposed scheme, furthermore, a proxy signer can recover his/her own share from t other proxy shares without revealing any information about other proxy shares. Unless more than t other proxy signers cooperate and collude, the secret share algorithm is always secure. We compare the performance of four schemes: Hwang et al., Wen et al., Geng …",
      "url": "https://link.springer.com/article/10.1007/s11277-014-2087-2",
      "citationUrl": "/scholar?hl=en&cites=3403183525057471960"
    },
    {
      "title": "An efficient segmentation method for overlapping chromosome images",
      "year": "",
      "authors": "Tanvi Tanvi and Renu Dhir",
      "citations": 18,
      "journal": "International Journal of Computer Applications",
      "abstract": "An Efficient Segmentation Method for Overlapping Chromosome Images - NASA/ADS Now on \nhome page ads icon ads Enable full ADS view NASA/ADS An Efficient Segmentation Method \nfor Overlapping Chromosome Images Tanvi, Tanvi ; Dhir, Renu Abstract Publication: \nInternational Journal of Computer Applications Pub Date: June 2014 DOI: 10.5120/16560-4861 \nBibcode: 2014IJCA...95a..29T full text sources Publisher | © The SAO/NASA Astrophysics Data \nSystem adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical \nObservatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian \nlogo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog \nProject Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian \nPrivacy Notice Smithsonian Terms of Use Smithsonian Astrophysical Observatory NASA …",
      "url": "https://ui.adsabs.harvard.edu/abs/2014IJCA...95a..29T/abstract",
      "citationUrl": "/scholar?hl=en&cites=6088746038771246278"
    },
    {
      "title": "Feature extraction of Gurmukhi script and numerals: a review of offline techniques",
      "year": "",
      "authors": "Gurpreet Singh and Chandan Jyoti Kumar and Rajneesh Rani and Renu Dhir",
      "citations": 18,
      "journal": "",
      "abstract": "Offline Isolated handwritten Gurmukhi character recognition has been a very intensive area of research during last decades due to it is wide range of solution to real world problems. A lot of work has been done in languages like Chinese, Arabic, Devnagari, Urdu and English [1-3]. Research on the different stages of OCR of Gurmukhi script is being carried out by the authors and their M. Tech students at Punjabi University, Patiala. A preliminary work was done by Sanjeev Kumar [4] and Khushwant Kaur [5] under the guidance of one of the authors, Lehal, developing a feature based Gurmukhi recognition script system. The count and location of local features such as endpoints, T-points, cross points and loops were used to identify isolated Gurmukhi characters A neural networks based Gurmukhi recognition system has been developed by Goyal et. al.[6]. Range free skew detection algorithms for de-skewing Gurumukhi machine printed text skewed at any angle, have been developed by Lehal and Madan [7] and Lehal and Dhir [8]. If different classifiers cooperate with each other, group decisions may reduce errors drastically and achieve a higher performance. In this survey, focuses on the various techniques used for recognition of isolated offline handwritten characters in Gurmukhi script. The whole process consists of two stages. The first, feature extraction stage analyzes the set of isolated characters and selects a set of features that can be used to uniquely identify characters. The performance depends heavily on what features are being used.",
      "url": "https://scholar.google.com/scholar?cluster=16718808056496777780&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=16718808056496777780"
    },
    {
      "title": "Cryptanalysis and performance evaluation of enhanced threshold proxy signature scheme based on RSA for known signers",
      "year": "",
      "authors": "Raman Kumar and Harsh Kumar Verma and Renu Dhir",
      "citations": 17,
      "journal": "Mathematical Problems in Engineering",
      "abstract": "In these days there are plenty of signature schemes such as the (t, n) threshold proxy signature scheme (Kumar and Verma 2010). The network is a shared medium so that the weakness security attacks such as eavesdropping, replay attack, and modification attack. Thus, we have to establish a common key for encrypting/decrypting our communications over an insecure network. In this scheme, a (t, n) threshold proxy signature scheme based on RSA, any t or more proxy signers can cooperatively generate a proxy signature while t − 1 or fewer of them cannot do it. The threshold proxy signature scheme uses the RSA cryptosystem to generate the private and the public key of the signers (Rivest et al., 1978). Comparison is done on the basis of time complexity, space complexity, and communication overhead. We compare the performance of four schemes (Hwang et al. (2003), Kuo and Chen (2005), Yong‐Jun et al …",
      "url": "https://onlinelibrary.wiley.com/doi/abs/10.1155/2013/790257",
      "citationUrl": "/scholar?hl=en&cites=12053292279570197059"
    },
    {
      "title": "Modified Gabor feature extraction method for word level script identification-experimentation with Gurumukhi and English scripts",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Gurpreet Singh Lehal",
      "citations": 16,
      "journal": "International journal of signal processing, image processing and pattern recognition",
      "abstract": "Script Identification is one of the challenging step in the Optical Character Recognition system for multi-script documents. In Indian and Non-Indian context some results have been reported, but research in this field is still emerging. This paper presents a research work in the identification of Gurmukhi and English scripts at word level. It also identifies English Numerals from Gurmukhi text. Gabor feature extraction is one of most popular method for script recognition. This paper presents a zone based gabor feature extraction technique. The given word image after normalization is divided into different zones of different sizes and then features from each of these zones are extracted in various directions using gabor filters. Script is then determined by using SVM classifier. The experimental tests carried out in the field of Gurmukhi and English Script recognition show that the proposed technique leads to improvement over the traditional Gabor feature extraction without zoning. In future, this can also be extended for other scripts.",
      "url": "https://www.researchgate.net/profile/Rajneesh-Rani/publication/269585945_Modified_Gabor_Feature_Extraction_Method_for_Word_Level_Script_Identification-_Experimentation_with_Gurumukhi_and_English_Scripts/links/568bdfa908ae129fb5cb8d3e/Modified-Gabor-Feature-Extraction-Method-for-Word-Level-Script-Identification-Experimentation-with-Gurumukhi-and-English-Scripts.pdf",
      "citationUrl": "/scholar?hl=en&cites=4649181002897885354"
    },
    {
      "title": "Text document clustering based on frequent concepts",
      "year": "",
      "authors": "Rekha Baghel and Renu Dhir",
      "citations": 16,
      "journal": "",
      "abstract": "This paper presents a novel technique of document clustering based on frequent concepts. The proposed FCDC (Frequent Concepts based Document Clustering), a clustering algorithm works with frequent concepts rather than frequent itemsets used in traditional text mining techniques. Many well known clustering algorithms deal with documents as bag of words while they ignore the important relationship between words like synonym relationship. The proposed algorithm utilizes the semantic relationship between words to create concepts. It exploits the WordNet ontology in turn to create low dimensional feature vector which allows developing a more accurate clustering algorithm.",
      "url": "https://ieeexplore.ieee.org/abstract/document/5679969/",
      "citationUrl": "/scholar?hl=en&cites=17732768031951592439"
    },
    {
      "title": "Empirical analysis of machine learning techniques for context aware recommender systems in the environment of IoT",
      "year": "",
      "authors": "Nitin Sachdeva and Renu Dhir and Akshi Kumar",
      "citations": 15,
      "journal": "",
      "abstract": "At present recommender systems (RS) are incorporating contextual and social data of the client, delivering context aware RS where it take request response approach in which the recommendations are given to the client upon his solicitation. Later on they will utilize verifiable data of the client anywhere from the Internet of Things (IoT). Currently, a proactive RS that pushes proposals to the client when the present circumstance appears proper, without unequivocal client demand has been presented in the exploration research field of RS. In this paper, an outline of a context aware RS that prescribes recommendations under the IoT worldview is proposed. We also did the empirical analysis of the Machine Learning (ML) techniques like Genetic Algorithm optimized Artificial Neural Network (GA-ANN), decision tree, ANN, bagging, boosting which will perform the reasoning of the context. All inputs are virtually derived …",
      "url": "https://dl.acm.org/doi/abs/10.1145/2979779.2979818",
      "citationUrl": "/scholar?hl=en&cites=12913300926141056603"
    },
    {
      "title": "Hybrid black hole algorithm for bi-criteria job scheduling on parallel machines",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir and Paramvir Singh",
      "citations": 15,
      "journal": "International Journal of Intelligent Systems and Applications",
      "abstract": "Nature-inspired algorithms are recently being appreciated for solving complex optimization and engineering problems. Black hole algorithm is one of the recent nature-inspired algorithms that have obtained inspiration from black hole theory of universe. In this paper, four formulations of multi-objective black hole algorithm have been developed by using combination of weighted objectives, use of secondary storage for managing possible solutions and use of Genetic Algorithm (GA). These formulations are further applied for scheduling jobs on parallel machines while optimizing bi-criteria namely maximum tardiness and weighted flow time. It has been empirically verified that GA based multi-objective Black Hole algorithms leads to better results as compared to their counterparts. Also the use of combination of secondary storage and GA further improves the resulting job sequence. The proposed algorithms are further compared to some of the existing algorithms, and empirically found to be better. The results have been validated by numerical illustrations and statistical tests.",
      "url": "https://www.mecs-press.org/ijisa/ijisa-v8-n4/IJISA-V8-N4-1.pdf",
      "citationUrl": "/scholar?hl=en&cites=4995732839192537907"
    },
    {
      "title": "Pericardial effusion with vesiculobullous lesions in a young female",
      "year": "",
      "authors": "R Dhir and PLK Desylva and Neetu Gehi and A Malik and YD Singh and H Jagannayakulu and PS Tampi and R Ramasethu",
      "citations": 15,
      "journal": "Indian Journal of Dermatology, Venereology and Leprology",
      "abstract": "DISCUSSIONSLE is a chronic, recurrent, potentially fatal, multi system, inflammatory disorder that can often be difficult to diagnose. There is no single diagnostic marker for the disease; instead, it is diagnosed through a combination of clinical and laboratory criteria. Early and accurate diagnosis of this disorder is important because proper treatment can reduce disease morbidity and mortality, especially due to nephritis.[1] The preliminary criteria for the classification of SLE were suggested in 1971 by the American Rheumatism Association (ARA) now known as American College Rheumatology (ACR). These criteria were revised in 1982 using 30 potential variables and later updated in 1997.[1]Bullous systemic lupus erythematosus is an extremely uncommon subset of lupus erythematosus (LE) and has distinct clinical, histological and immunopathological features. Clinically it manifests as tense vesiculobullous lesions arising upon but not limited to sun-exposed skin. Less than 5% patients of SLE develop vesiculobullous lesions in addition to other cutaneous manifestations like malar rash. However, it is extremely rare to find bullous skin lesions as the only cutaneous manifestation of SLE. The morphology varies from herpetiform vesicles to large hemorrhagic bullae. Apart from a chronic, widespread blistering eruption, a mild, transient blistering eruption has also been reported.[2] The histological examination shows neutrophilic dermal infiltrate and subepidermal separation.[3] Contrary to traditional teaching, IIF studies have shown that type VII collagen may not be the only target antigen in bullous SLE,[4] with Chan et al.[5] showing autoantibodies …",
      "url": "https://ijdvl.com/article?issn=0378-6323;year=2006;volume=72;issue=2;spage=175;epage=177;aulast=Dhir",
      "citationUrl": "/scholar?hl=en&cites=8733871868964976256,13832376524119814588"
    },
    {
      "title": "Geometric feature-based classification of segmented human chromosomes",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 14,
      "journal": "International Journal of Image and Graphics",
      "abstract": "The chromosomes are the carriers of the geometric information, any alteration in the structure or number of these chromosomes is termed as genetic defect. These alterations cause malfunctioning in the proteins and are cause of the various underlying medical conditions that are hard to cure or detect by normal clinical procedures. In order to detect the underlying causes of these defects, the cells of the humans need to be imaged during the mitosis phase of cell division. During this phase, the chromosomes are the longest and can be easily studied and the alterations in the structure and count of the chromosomes can be analyzed easily. The chromosomes are non-rigid objects, due to which they appear in varied orientations, which makes them hard to be analyzed for the detection of structural defects. In order to detect the genetic abnormalities due to structural defects, the chromosomes need to be in straight …",
      "url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467820500060",
      "citationUrl": "/scholar?hl=en&cites=10195466373340782039"
    },
    {
      "title": "Sentiments mining and classification of music lyrics using SentiWordNet",
      "year": "",
      "authors": "Vivek Sharma and Apoorv Agarwal and Renu Dhir and Geeta Sikka",
      "citations": 14,
      "journal": "",
      "abstract": "The Lyrical part of a song is a rich source of datasets containing words that are helpful in analysis and classification of sentiments generated from it Sentimental analysis is not mere a social analytics but it is a field of study in which whole perception of individuals are automated to find the underlying details of the subject. The goal of this experiment is doing a linguistic analysis of Lyrics to classify them whether the respective songs are suitable for audience or not by classifying them with positive and negative content present in them. In order to perform this, Words containing sentiments have been analyzed and tagged using POS-Tagger. They are finally processed with the Sentiment scores fetched from SentiWordNet.",
      "url": "https://ieeexplore.ieee.org/abstract/document/7570965/",
      "citationUrl": "/scholar?hl=en&cites=10030412225203738287"
    },
    {
      "title": "Analyze the impact of mobility on performance of routing protocols in MANET using OPNET modeller",
      "year": "",
      "authors": "Narinder Pal and Renu Dhir",
      "citations": 14,
      "journal": "International Journal of Advanced Research in Computer Science and Software Engineering",
      "abstract": "MANET stands for Mobile Ad hoc Network. An ad hoc network is often referred to as an “infrastructure less” network, because the network does not need fixed routers [1]. These nodes are mobile communicating through wireless medium. Each ad hoc node may be capable of acting as a router. It’s characterized by multi-hop wireless connection and frequently changing networks. In this paper we evaluate the performance the performance of ad hoc routing protocols ie AODV (Ad hoc On-demand Distance Vector), OLSR (Optimized Link State Routing) and GRP (Gathering Based Routing Protocol) under Random Way Point and Vector Mobility model by undertaking three parameters such as delay, network load, and throughput.",
      "url": "https://scholar.google.com/scholar?cluster=15796177539874395964&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=15796177539874395964"
    },
    {
      "title": "Recognition of Devanagari handwritten numerals using gradient features and SVM",
      "year": "",
      "authors": "Ashutosh Aggarwal and Rajneesh Rani and Renu Dhir",
      "citations": 14,
      "journal": "International Journal of Computer Applications",
      "abstract": "Recognition of Devanagari Handwritten Numerals using Gradient Features and SVM - \nNASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Recognition of \nDevanagari Handwritten Numerals using Gradient Features and SVM Aggarwal, Ashutosh ; \nRani, Rajneesh ; Dhir, Renu Abstract Publication: International Journal of Computer \nApplications Pub Date: June 2012 DOI: 10.5120/7371-0151 Bibcode: 2012IJCA...48h..39A full \ntext sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu \nThe ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative \nAgreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help \nWhat's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? \n(or is it just me...) Smithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of Use …",
      "url": "https://ui.adsabs.harvard.edu/abs/2012IJCA...48h..39A/abstract",
      "citationUrl": "/scholar?hl=en&cites=16208058648094935449"
    },
    {
      "title": "Combination of different feature sets and SVM classifier for handwritten Gurumukhi numeral recognition",
      "year": "",
      "authors": "Anita Rani and Rajneesh Rani and Renu Dhir",
      "citations": 14,
      "journal": "International Journal of Computer Applications",
      "abstract": "A lot of research has been done in recognizing handwritten characters in many languages like Chinese, Arabic, Devnagari, Urdu and English. This paper focuses on the problem of recognition of isolated handwritten numerals in Gurumukhi script. We have used different feature extraction techniques such as projection histograms, background directional distribution (BDD) and zone based diagonal features. Projection Histograms count the number of foreground pixels in different directions such as horizontal, vertical, left diagonal and right diagonal creating 190 features. In Background Directional Distribution (BDD) features background distribution of neighbouring background pixels to foreground pixels in 8-different directions is considered forming a total of 128 features. In the computation of diagonal features, image is divided into 64 equal zones each of size 4× 4 pixels then features are extracted from the pixels of each zone by moving along its diagonal, thus consisting of total 64 features. Different combinations of these features are used for forming different feature vectors. These feature vectors are classified using SVM classifier as 5-fold cross validation with RBF (radial basis function) kernel. The highest accuracy achieved is 99.4% of whole database using combination of background directional distribution and diagonal features with SVM classifier.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=0baabb31055bce7272bd5e419c7cdbc36f7afacf",
      "citationUrl": "/scholar?hl=en&cites=14888577114873255051"
    },
    {
      "title": "A new efficient matrix based frequent itemset mining algorithm with tags",
      "year": "",
      "authors": "Harpreet Singh and Renu Dhir",
      "citations": 13,
      "journal": "International Journal of Future Computer and Communication",
      "abstract": "The main aim of this paper is to present a new method based on transactional matrix and transaction reduction for finding frequent itemsets more efficiently. The association rule mining is based mainly on discovering frequent itemsets. Apriori algorithm is the most classical algorithm in association rule mining, but it has two fatal deficiencies: generation of a large number of candidate itemsets and scanning the database too many times. Apriori and other popular association rule mining algorithms mainly generate a large number of candidate 2-itemsets. To remove these deficiencies, a new method named Matrix Based Algorithm with Tags (MBAT) is proposed in this paper which finds the frequent itemsets directly from the transactional matrix which is generated from the database to generate association rules. Proposed algorithm greatly reduces the number of candidate itemsets, mainly candidate 2-itemsets",
      "url": "https://ijfcc.org/papers/184-C1003.pdf",
      "citationUrl": "/scholar?hl=en&cites=11772001955263251792"
    },
    {
      "title": "Web client and web server approaches to prevent xss attacks",
      "year": "",
      "authors": "Jyoti Snehi and Renu Dhir",
      "citations": 13,
      "journal": "International Journal of Computers & Technology",
      "abstract": "Websites rely completely on complex web applications to deliver content to all users according to set preferences and specific needs. In this manner organizations provide better value to their customers and prospects. Dynamic websites suffer from various vulnerabilities rendering organizations helpless and prone to cross site scripting attacks. Cross Site Scripting attacks are difficult to detect because they are executed as a background process. Cross Site Scripting is the most common web vulnerabilities in existence today which is most exploited issue. In this paper we have presented various approaches used by clients and Server to prevent XSS attacks",
      "url": "https://www.researchgate.net/profile/Jyoti-Snehi/publication/324986959_Web_Client_and_Web_Server_approaches_to_Prevent_XSS_Attacks/links/5b334e9baca2720785e9bf0b/Web-Client-and-Web-Server-approaches-to-Prevent-XSS-Attacks.pdf",
      "citationUrl": "/scholar?hl=en&cites=10061057548800322299"
    },
    {
      "title": "Design and comparison of advanced color based image CAPTCHAs",
      "year": "",
      "authors": "Mandeep Kumar and Renu Dhir",
      "citations": 13,
      "journal": "International Journal of Computer Applications",
      "abstract": "CAPTCHA is a technology which has its base in a test called the Turing Test. Alan Turing, proposed this test as a way to examine whether or not machines can think or appear to think like humans. The main purpose of a CAPTCHA is to block form submissions from spam bots-that is automated scripts. Various types of CAPTCHAs are used, which mostly requires users to enter the strings of characters that appear in distorted form on the screen. These types of distorted stings are unable to understand by bots but human can. The CAPTCHA types are either text based or image based. In this paper, a new color based CAPTCHA is described, which provides color based images to human and human will answer to interrogator with color name or so on the question asked during turing test. These colored images can have single color image, more than one color image or it can have images with objects (like monitor, car, flower etc). For these types of questions, the computer machine will be unable to answer and it means unable to break CAPTCHA. This paper describes in detail the proposed CAPTCHA technology principle, method of implementation, variations and comparison of the accuracy rates. We conducted various experiments to measure the viability and usability of this CAPTCHA approach. An accuracy of 100%, 95% and 90% is observed with single color, multi color and color image based CAPTCHAs respectively.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=4d6d0c4891892744f9cf150fffbf95eb594aa820",
      "citationUrl": "/scholar?hl=en&cites=11627590272403468499"
    },
    {
      "title": "Performance analysis of feature extractors and classifiers for script recognition of English and Gurmukhi words",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Gurpreet Singh Lehal",
      "citations": 13,
      "journal": "",
      "abstract": "Script Recognition is a challenging field for the recognition of documents in a multilingual country like India where different scripts are in use. For optical character recognition of such multilingual documents, it is necessary to separate blocks, lines, words and characters of different scripts before feeding them to the OCRs of individual scripts. Many approaches have been proposed by the researchers towards script recognition at different levels (Block, Line, Word and Character Level). Normally Indian documents, in any its state language contain English words mixed with other words in its own state language. In this paper, we extract three different types of features: Structural, Gabor and Discrete Cosine Transforms(DCT) Features from Isolated English and Gurmukhi words and compare their script recognition performance using three different classifiers: Support Vector Machine (SVM), k-Nearest Neighbor and Parzen …",
      "url": "https://dl.acm.org/doi/abs/10.1145/2432553.2432559",
      "citationUrl": "/scholar?hl=en&cites=7451088420726315550"
    },
    {
      "title": "Bandwidth delay quality parameter based multicast congestion control",
      "year": "",
      "authors": "Karan Singh and Rama Shankar Yadav and Manisha Manjul and Renu Dhir",
      "citations": 13,
      "journal": "",
      "abstract": "Computer network is an important phenomenon for digital information world. Computer network having the various problem due to more demand such as congestion control security, reliability, scalability, fairness etc. Multicast service helps computer network to flow information from one end to another end. In this paper, we provide BDQP approach to minimize the congestion control. NS-2 result shows, BDQP congestion control scheme minimizes the congestion and provides better network performance to provide more quality data.",
      "url": "https://ieeexplore.ieee.org/abstract/document/4760479/",
      "citationUrl": "/scholar?hl=en&cites=16953855600015574552"
    },
    {
      "title": "Threshold-based empirical validation of object-oriented metrics on different severity levels",
      "year": "",
      "authors": "Aarti and Geeta Sikka and Renu Dhir",
      "citations": 11,
      "journal": "International Journal of Intelligent Engineering Informatics",
      "abstract": "Software metrics has become desideratum for the fault-proneness, reusability and effort prediction. To enhance and intensify the sufficiency of object-oriented (OO) metrics, it is crucial to perceive the relationship between OO metrics and fault-proneness at distinct severity levels. This paper characterise on the investigation of the software parts with higher probability of occurrence of faults. We examined the effect of thresholds on the OO metrics and build the predictive model based on those threshold values. This paper also instanced on the empirical validation of threshold values calculated for the OO metrics for predicting faults at different severity levels and builds the statistical model using logistic regression. This paper depicts the detection of fault-proneness by extracting the relevant OO metrics and focus on those projects that falls outside the specified risk level for allocating the more resources to them. We …",
      "url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJIEI.2019.099090",
      "citationUrl": "/scholar?hl=en&cites=6277180060560080375"
    },
    {
      "title": "An algorithm to straighten the bent human chromosomes",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir and Manish Mahajan",
      "citations": 11,
      "journal": "",
      "abstract": "The chromosomes are the genetic information carriers. Any alteration either in the structure of the chromosomes or the number of chromosomes present inside a cell, results in a medical condition termed as genetic defects. The chromosomes are non-rigid objects, they appear in different orientations such as straight, bent, touching or overlapping. Due to this it is very difficult to study the structure of the chromosomes and uncover the genetic defects related to the structural abnormalities. In this work an algorithm is being proposed to straighten the bent chromosomes, in which straight chromosomes are reconstructed using the pixel positions along the bending point of the bent chromosome. It is an iterative procedure which can detect and correct any number of bends in the chromosomes. The straight chromosome thus reconstructed is verified by using density profile, centromere position. The chromosomes thus …",
      "url": "https://ieeexplore.ieee.org/abstract/document/8313772/",
      "citationUrl": "/scholar?hl=en&cites=310570583721915316"
    },
    {
      "title": "Video Text extraction and recognition: A survey",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 11,
      "journal": "",
      "abstract": "A means to naturally recognizing and fetching out the content of video description would possibly make them indexed in considerable and appropriate way for later reference, and would facilitate actions viz. automatic notification and dissemination, to be triggered in real time by the contents of streaming video. Video text recognition, or video OCR, is a constructive tool to characterize the contents of video containing overlay text (text captions superimposed over the video imagery, such as in broadcast news programs) and scene text (text that appears in the real scene of the video, such as text on street signs, nameplates, and billboards). In this paper exhaustive survey is done for text detecting, extraction and recognizing in complex images and video frames. Digital Videos are widely used both professionally and domestically because of the easy availability of camcorders to mobile phones. People are increasingly …",
      "url": "https://ieeexplore.ieee.org/abstract/document/7566360/",
      "citationUrl": "/scholar?hl=en&cites=4560776680892839001"
    },
    {
      "title": "Zone-based feature extraction techniques and SVM for handwritten gurmukhi character recognition",
      "year": "",
      "authors": "Gita Sinha and Anita Rani and Renu Dhir and Rajneesh Rani",
      "citations": 11,
      "journal": "International Journal of Advanced Research in Computer Science and Software Engineering",
      "abstract": "In this paper we present an overview of Feature Extraction techniques for off-line recognition of isolated Gurumukhi characters recognition. Selection of Feature Extraction method is probably the single most important factor in achieving high performance in pattern recognition. Our paper presents Zone based approach which is the combination of image centroid zone and zone centroid zone of numeral/character image. In image centroid zone character is divided into n equal zone and then image centroid and the average distance from character centroid to each zones/grid/boxes present in image is calculated. Similarly, in zone centroid zone character image is divided into n equal zones and centroid of each zones/boxes/grid and average distance from zone centroid to each pixel present in block/zone/grid is calculated. We have used SVM for subsequent classifier and recognition purpose. We obtained 95.11% recognition accuracy.",
      "url": "https://scholar.google.com/scholar?cluster=6091175532014038793&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=6091175532014038793"
    },
    {
      "title": "Moment based invariant feature extraction techniques for bilingual character recognition",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 11,
      "journal": "",
      "abstract": "Feature extraction is an important phase in optical character recognition (OCR). Moment based features are very effective in describing shape of characters. In this paper the efficiency of these features for Bilingual Character Recognition (Gurmukhi and Roman) is studied. The detailed analysis for minimizing within-class variability and maximizing between-class variability is studied and it is observed that only a few moments provide this capability. It is observed that moment based features can become very effective if certain operations such as normalization of character size and geometric operations are performed correctly using floating point arithmetic. Based on the analysis of reconstructed images with Zernike moments, pseudo Zernike moments and orthogonal Fourier - Mellin moments, using the first 12, 6 and 7 order of the moments, respectively, it is recommended to compose the feature vectors in order to …",
      "url": "https://ieeexplore.ieee.org/abstract/document/5529730/",
      "citationUrl": "/scholar?hl=en&cites=1498292940637428174"
    },
    {
      "title": "Indian drug review",
      "year": "",
      "authors": "S Malik and K Kishor and BB Gupta and R Dhir",
      "citations": 11,
      "journal": "A Mediworld Publication",
      "abstract": "",
      "url": "https://scholar.google.com/scholar?cluster=4529875968676564803&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=4529875968676564803"
    },
    {
      "title": "Epithelioid sarcoma of the upper extremity with cerebral metastases",
      "year": "",
      "authors": "AJ Rege and RS Dhir and V Pradeep",
      "citations": 11,
      "journal": "Journal of Postgraduate Medicine",
      "abstract": "A forty year old male patient presented with swollen, deformed right hand with multiple irregular ulcers. The axillary lymph nodes were enlarged, firm and tender. The biopsy of nodules present on the hand revealed areas of haemorrhage and necrosis. The histopathological examination confirmed the clinical diagnosis of epithelioid sarcoma. Following below-elbow amputation, patient failed to regain consciousness and expired. On autopsy, distant metastases were found in the regional lymph nodes, pleura, kidney and cerebrum.",
      "url": "https://journals.lww.com/jopm/fulltext/1992/38040/epithelioid_sarcoma_of_the_upper_extremity_with.10.aspx",
      "citationUrl": "/scholar?hl=en&cites=6292593904564233826"
    },
    {
      "title": "Crack detection in concrete using transfer learning",
      "year": "",
      "authors": "NIKKEY Sharma and RENU Dhir and RAJNEESH Rani",
      "citations": 10,
      "journal": "Adv. Math. Sci. J",
      "abstract": "This work demonstrates the use of pretrained network for the detection of crack in the concrete. The SDNET2018 dataset is used for the training of the network which consists of more than 56,000 images. The dataset includes the images of Bridge Deck, Walls and Pavements. The images are captured under different surface and environmental condition. The dataset is divided into 90% training and 10% testing data for each of the category. This work provides the comparison of the AlexNet network with GoogLeNet and ResNet18 in transfer learning mode. It is observed that GoogLeNet and ResNet18 has introduced significant improvement in case of Bridge Deck and Walls but achieved only little improvement in case of Pavement images.",
      "url": "https://www.researchgate.net/profile/Rajneesh-Rani/publication/343048901_CRACK_DETECTION_IN_CONCRETE_USING_TRANSFER_LEARNING/links/5f57660b92851c250b9d0efd/CRACK-DETECTION-IN-CONCRETE-USING-TRANSFER-LEARNING.pdf",
      "citationUrl": "/scholar?hl=en&cites=12725022346717311722"
    },
    {
      "title": "Software module clustering using hybrid socio-evolutionary algorithms",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 10,
      "journal": "International Journal of Information Engineering and Electronic Business",
      "abstract": "Design of the software system plays a crucial role in the effective and efficient maintenance of the software system. In the absence of original design structure it might be required to re-identify the design by using the source code of the concerned software. Software clustering is one of the powerful techniques which could be used to cluster large software systems into smaller manageable subsystems containing modules of similar features. This paper examines the use of novel evolutionary imperialist competitive algorithms, genetic algorithms and their combinations for software clustering. Apparently, recursive application of these algorithms result in the best performance in terms of quality of clusters, number of epochs required for convergence and standard deviation obtained by repeated application of these algorithms.",
      "url": "https://www.mecs-press.org/ijieeb/ijieeb-v8-n4/IJIEEB-V8-N4-6.pdf",
      "citationUrl": "/scholar?hl=en&cites=6591627380685191435"
    },
    {
      "title": "Joint watermarking and fingerprinting approach for colored digital images in double DCT domain",
      "year": "",
      "authors": "Vineet Mehan and Renu Dhir and Yadwinder Singh Brar",
      "citations": 10,
      "journal": "",
      "abstract": "Digital watermarking has developed immensely for multimedia uses in the current decade. The requirement for protected digital content grows vital with the enhancement in exchange of digital images on internet. Watermarking is a technique to safeguard digital media by retaining the owner's possession. Fingerprinting extends the watermarking concept by embedding unique purchaser's information. This paper presents a joint digital watermarking and fingerprinting approach for colored digital images applied in double DCT domain. The approach aims at copyright protection and traitor identification of digital images. Altered mid-frequency coefficients are analyzed by applying forward DCT transform. Watermark and fingerprint are embedded in a non-overlying manner. Second DCT allows for the precise determination of the block, for embedding data. The double domain can enhance the embedding capacity of the …",
      "url": "https://ieeexplore.ieee.org/abstract/document/6663390/",
      "citationUrl": "/scholar?hl=en&cites=15491543523647537856"
    },
    {
      "title": "Identification of printed Punjabi words and English numerals using Gabor features",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and GS Lehal",
      "citations": 10,
      "journal": "World Academy of Science, Engineering and Technology",
      "abstract": "Script identification is one of the challenging steps in the development of optical character recognition system for bilingual or multilingual documents. In this paper an attempt is made for identification of English numerals at word level from Punjabi documents by using Gabor features. The support vector machine (SVM) classifier with five fold cross validation is used to classify the word images. The results obtained are quite encouraging. Average accuracy with RBF kernel, Polynomial and Linear Kernel functions comes out to be greater than 99%.",
      "url": "https://www.academia.edu/download/107912573/pdf.pdf",
      "citationUrl": "/scholar?hl=en&cites=4039601073888615355"
    },
    {
      "title": "Novel grey relational feature extraction algorithm for software fault-proneness using BBO (B-GRA)",
      "year": "",
      "authors": "Aarti and Geeta Sikka and Renu Dhir",
      "citations": 9,
      "journal": "Arabian Journal for Science and Engineering",
      "abstract": "The inherent uncertainty of software gives a vague and imprecise solution when it is solved by human judgment. As the project expands, the issues of missing data values, outlier detection, feature subset selection and prediction of faultiness behaviour should be addressed. The feature selection process may lead to the production of high-dimensional data sets that may contribute to many irrelevant or redundant features. In this paper, we focussed on the optimal feature subset selection and fault prediction at the early stage of a project. We propose the novel approach of grey relational analysis (GRA) from grey system theory by optimizing the grey relational grade function using biogeography optimization referred to as B-GRA. The proposed algorithm gives resilience to users to select features for both continuous and categorical attributes. The issues such as feature subset selection, heterogeneity of data sets …",
      "url": "https://link.springer.com/article/10.1007/s13369-020-04445-2",
      "citationUrl": "/scholar?hl=en&cites=10797704056311272930"
    },
    {
      "title": "An investigation on the effect of cross project data for prediction accuracy",
      "year": "",
      "authors": "Aarti and Geeta Sikka and Renu Dhir",
      "citations": 9,
      "journal": "International Journal of System Assurance Engineering and Management",
      "abstract": "Quality assurance activities include software testing, verification, validation, fault proneness and fault prediction. Most of existing model predicts faults based on historical data (Within-project) through intellectual analysis. This paper instanced on defect prediction using cross-projects and mixed-project prediction because of the unpredictability in selection of software attributes by analogy based approach that deliver imprecise and ambiguous solution. Cross project delivers momentous results by focussing on selection of training data. Combination of cross project data with regression techniques improves effectiveness of prediction by extracting similar features impacted by all datasets. Feature extraction with similarity based approach creates training model that constitute more accurate prediction. We proposed two experiments with method-level and class level datasets on 23 open source projects with …",
      "url": "https://link.springer.com/article/10.1007/s13198-016-0439-x",
      "citationUrl": "/scholar?hl=en&cites=8662762482563450762"
    },
    {
      "title": "Segmentation Approaches for Human Metaspread Chromosome Images Using Level Set Methods.",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 9,
      "journal": "Trans. Mass Data Anal. Images Signals",
      "abstract": "The human metaspread images contain the chromosomes of an individual that are imaged during the metaphase stage of cell division. The chromosomes are the genetic information carriers, any alteration either in the number of chromosomes or the structure of chromosomes, results in a medical condition termed as genetic defects. The genetic defects can be cause of many diseases that are difficult to cure. In order to uncover the genetic defects the metaspread images are segmented, to count the number of chromosomes present or to study the structure of the chromosomes. The metaspread images suffer from intensity in homogeneity, because of which it is very difficult to extract the individual chromosomes by using conventional segmentation techniques. In this work various segmentation approaches are implemented and studied, to segment the chromosomes from the metaspread images. The minimization of region scalable fitting energy for image segmentation proposed by Chumming li et. al, is effective in segmenting the metaspread images that have intensity in homogeneity, as this technique uses the local intensity values of the nearby regions of the objects and find the approximate intensity values along both sides of the contour. The paper compares the level set based segmentation algorithms based upon their implementation techniques and the segmentation results. The methods have been compared in terms of number of objects segmented, time taken, complexity, type of segmentation approach. The ADIR dataset of metspread images has been taken for the purpose of experimentation.",
      "url": "https://www.academia.edu/download/77010906/massdata_7_1_13_30.pdf",
      "citationUrl": "/scholar?hl=en&cites=8728483053037900640"
    },
    {
      "title": "Gabor features based script identification of lines within a bilingual/trilingual document",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Gurpreet Singh Lehal",
      "citations": 9,
      "journal": "International Journal of Advanced Science and Technology",
      "abstract": "The OCR technology for Indian documents is in emerging stage and most of these Indian OCR systems can read the documents written in only a single script. As many commercial and official documents of different states of India are tri-lingual in nature, therefore identification of script and/or language is one of the elementary tasks for multi-script document recognition. A script recognizer simplifies the task of multi-lingual OCR by improving the accuracy and reducing the computational complexity. This script recognition may be at line, word or character level depending on interlacing of different scripts at different levels. This paper presents the effectiveness of Gabor Filter banks with kNN, SVM and PNN classifiers to identify the scripts at line level from such trilingual documents. The experiments show that Gabor features with SVM classifier achieve a recognition rate of 99.85% for trilingual documents.",
      "url": "https://www.academia.edu/download/107912572/96f7857a6154d237a3280b5978257a66dc95.pdf",
      "citationUrl": "/scholar?hl=en&cites=9085778217936988697"
    },
    {
      "title": "Energy based evaluation of routing protocol for MANETs",
      "year": "",
      "authors": "Nand Kishore and Sukhvir Singh and Renu Dhir",
      "citations": 9,
      "journal": "International Journal of Computer Sciences and Engineering",
      "abstract": "",
      "url": "https://scholar.google.com/scholar?cluster=14863209461437710785&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=14863209461437710785"
    },
    {
      "title": "Recognition of Handwritten Gurmukhi Numerals using gabor filters",
      "year": "",
      "authors": "Sukhpreet Singh and Renu Dhir",
      "citations": 9,
      "journal": "Int J Comput Appl",
      "abstract": "Isolated handwritten character recognition has been the subject of intensive research during the last decades because it is useful in wide range of real world problems. It also provides a solution for processing large volumes of data automatically. There is an emerging trend in the research of recognizing handwritten characters and numerals of many Indian languages and scripts. In this paper, two different feature sets based on Gabor filter have been used for recognition. One is being GABM having dimensionality 210 and other being GABN with dimensionality 200. The SVM classifier with RBF (Radial Basis Function) kernel is used for classification. The performance of the Gabor filter is tested on the database consisting of 1500 samples for basic 10 numerals of Gurmukhi script, collected from different writers. By using 7-fold cross validation, accuracy of 99.53% using second feature set and 98.4% using first feature set are observed. To obtain better results preprocessing of noise removal and normalization processes before feature extraction are recommended.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=7de788035f62244231f50892a27f663ef17e6c2a",
      "citationUrl": "/scholar?hl=en&cites=12119480870645713971"
    },
    {
      "title": "A comparative study of bayesian and fuzzy approach to assess and predict maintainability of the software using activity-based quality model",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir and Harsh Verma",
      "citations": 9,
      "journal": "ACM SIGSOFT Software Engineering Notes",
      "abstract": "Quality is considered as one of the most important aspects responsible for the success of the software. The developers as well as the end users of the software have accepted maintainability as a significant characteristic due to its economic implications. Several subjective techniques have been developed in research to assess and predict maintainability but all have been unsuccessful to do it practically and most of them even fail to define it appropriately. The activity-based quality model is one of the techniques that have been found to be successful in defining maintainability. This model assesses maintainability in terms of average efforts required to maintain software but lacks quantitative aspect that has been further added by using Bayesian Network. In this paper, a comparison of the Bayesian approach and Fuzzy approach to deal with this model quantitatively has been done wherein; Fuzzy approach has been …",
      "url": "https://dl.acm.org/doi/abs/10.1145/2180921.2180935",
      "citationUrl": "/scholar?hl=en&cites=17674353628690550515"
    },
    {
      "title": "Bayesian and fuzzy approach to assess and predict the maintainability of software: a comparative study",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 9,
      "journal": "International Scholarly Research Notices",
      "abstract": "Quality has always been one of the major issues responsible for the success of software. Maintainability is one of the characteristics of software quality. A large number of techniques were developed for the assess and predication of this characteristic. Most of these techniques do not decompose it to an actual assessment level and thus fail to give a detailed account of the impact of specific criteria. These techniques thus constrain their use as the basis for analysis quantitatively. In this paper, we develop a system based on fuzzy inference approach to assess and predict maintainability in a quantitative manner. This system is an enhancement of Bayesian approach which is using activity‐based quality model to deal with maintainability. We also compare the proposed fuzzy technique with an existing Bayesian approach to depict the improvement achieved due to the advantageous accuracy of fuzzy over crisp approach.",
      "url": "https://onlinelibrary.wiley.com/doi/abs/10.5402/2012/202980",
      "citationUrl": "/scholar?hl=en&cites=16659315289147414035"
    },
    {
      "title": "A variable region scalable fitting energy approach for human Metaspread chromosome image segmentation",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 8,
      "journal": "Multimedia Tools and Applications",
      "abstract": "The medical images often suffer from intensity inhomogeneity and therefore they are difficult to segment using the conventional image segmentation approaches. In this work an image segmentation approach is being presented, in which the region scalable fitting energy is variable for the regions inside and outside the contours. The energy term is defined along the two sides of the contour, by considering different scale parameters for the foreground and background regions. Two fitting functions are used to approximate the intensities of the foreground and background regions. The proposed method is able to deal with intensity inhomogeneity as a Gaussian kernel function has been used in the energy formulation. The kernel function is used to assign weights to the intensity values during energy formulation. Different scale parameters are used for the kernel function for background and foreground regions …",
      "url": "https://link.springer.com/article/10.1007/s11042-018-6550-z",
      "citationUrl": "/scholar?hl=en&cites=16467504043656368052"
    },
    {
      "title": "An automatic human chromosome metaspread image selection technique",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir",
      "citations": 8,
      "journal": "Knowledge and Information Systems",
      "abstract": "The human chromosome metaspread images are used to generate the karyogram that is used for the diagnosis of the genetic defects. The genetic defects occur due to variation in either the structure of the chromosomes or the number of chromosomes present in the cell. The human chromosome metaspread image selection process is very critical in the karyogram generation task. It is very tedious and time-consuming process and is generally done manually by an expert cytogeneticist. The manual selection results may be biased, and it is possible that the whole search space is not explored to find the best metaspread image. The mood of the cytogeneticist will also greatly affect the selection results. So there is a strong need to automate the process of human chromosome metaspread image selection process. The proposed approach ranks the metaspread images based upon the quality score that is …",
      "url": "https://link.springer.com/article/10.1007/s10115-017-1024-6",
      "citationUrl": "/scholar?hl=en&cites=15706387413059112367"
    },
    {
      "title": "Anatomy of ransomware malware: detection, analysis and reporting",
      "year": "",
      "authors": "Gurdip Kaur and Renu Dhir and Maninder Singh",
      "citations": 8,
      "journal": "International Journal of Security and Networks",
      "abstract": "Rapidly increasing malware samples pose a serious threat to cyber security especially when they are not getting detected by security tools and techniques. Malware writers obfuscate the malware samples to conceal malicious code inside a legitimate executable to evade antivirus solutions and tamper it without changing its genuine structure to exploit target machines and remain fully undetected (FUD). Thus, it is a major challenge before Cyber Clean operations run by various government agencies to monitor malicious activities in their official network. Ransomware is a malware that encrypts documents to breach information on victim machine and asks for ransom to provide the decryption key. This paper presents the results of static and dynamic analysis of nine prominent variants of ransomware samples obtained from renowned malware repositories. A test bed is prepared to analyse these samples in Cuckoo's …",
      "url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJSN.2017.084399",
      "citationUrl": "/scholar?hl=en&cites=9076223359944376488"
    },
    {
      "title": "Relapse in psoriasis after methotrexate",
      "year": "",
      "authors": "R Dhir and MA Tutakne and KVR Chari",
      "citations": 8,
      "journal": "Indian Journal of Dermatology, Venereology and Leprology",
      "abstract": "A preliminary report on follow up of 15 patients treated with Methotrexate (MTX) is presented. All 5 cases where MTX was discontinued after achieving remission and giving maintenance therapy for 8 to 12 weeks have relapsed within 10 weeks of stoppage of MTX. No major toxicity was seen in any patient.",
      "url": "https://ijdvl.com/article?issn=0378-6323;year=1992;volume=58;issue=2;spage=77;epage=79;aulast=Dhir;type=0;aid=ijdvl_1992_58_2_77_3755",
      "citationUrl": "/scholar?hl=en&cites=8887444260031532681"
    },
    {
      "title": "Deactivation of cellulase at the air–liquid interface is the main cause of incomplete cellulose conversion at low enzyme loadings. Sci Rep. 2018; 8: 1–12",
      "year": "",
      "authors": "S Bhagia and R Dhir and R Kumar and CE Wyman",
      "citations": 8,
      "journal": "",
      "abstract": "",
      "url": "https://scholar.google.com/scholar?cluster=1933144199788764081&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=1933144199788764081"
    },
    {
      "title": "Grey relational classification algorithm for software fault proneness with SOM clustering",
      "year": "",
      "authors": "Aarti and Geeta Sikka and Renu Dhir",
      "citations": 7,
      "journal": "International Journal of Data Mining, Modelling and Management",
      "abstract": "The estimation by the human judgment to deal with the inherent uncertainty of software gives a vague and imprecise solution. To cope with this challenge, we propose a new hybrid analogy model based on the integration of grey relational analysis (GRA) classification with self-organising map (SOM) clustering. In this paper, a new classification approach is proposed to distribute the data to similar groups. The attributes are selected based on GRC values. In the proposed, the similarity measure between reference project and cluster head is computed to determine the cluster to which target project belongs. The fault-proneness of reference project is estimated based on the regression equation of the selected cluster. The proposed algorithm gives resilience to users to select features for both continuous and categorical attributes. In this study, two scenarios based on the integration of proposed classification with …",
      "url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJDMMM.2020.105599",
      "citationUrl": "/scholar?hl=en&cites=7716202687892564517"
    },
    {
      "title": "Cyber crime investigation and network forensic system using honeypot",
      "year": "",
      "authors": "Rajni Misra and Renu Dhir",
      "citations": 7,
      "journal": "International Journal of Latest Trends in Engineering and Technology (IJLTET). ISSN",
      "abstract": "Network Forensic is one of the most promising approaches for the network security. Under the umbrella of network security, the network forensic is regarded as the extension of the traditional security model. Apart from the general emphasis on prevention and detection of network attacks as in primitive network security model, the network forensics focuses on the collection, observation and preservation of network data so as to analyze and organize traffic data using clustering or various other data mining techniques for data verification. Here honeypots were used to lure and trick attackers using network deception, by making possible security vulnerabilities and has very good camouflage place. Also used were the various NFATs for the purpose of maximum fidelity of data collection. A prototype system is developed to collect the network logs using honeypot infrastructure and analyze all the logged traffic, which are highly malicious in nature with large volume of attacker’s information. The end result of the system was to collect network data which were highly malicious in nature and were used for further investigation to get the intelligent information about the attackers as evidence for Network Forensics.",
      "url": "https://scholar.google.com/scholar?cluster=7010836248860954567&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=7010836248860954567"
    },
    {
      "title": "A survey: Recognition of scripts in bi-lingual/multi-lingual indian documents",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir",
      "citations": 7,
      "journal": "national journal of PIMT Journal of Research",
      "abstract": "",
      "url": "https://scholar.google.com/scholar?cluster=8666692731686451059&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=8666692731686451059"
    },
    {
      "title": "A Structural Feature Based Approach for Script Identification of Gurmukhi and Roman Character and Words",
      "year": "",
      "authors": "Renu Dhir and Chandan Singh and GS Lehal",
      "citations": 7,
      "journal": "The proc. of 39th Annual National Convention of Computer Society of India (CSI) held at Mumbai, India",
      "abstract": "",
      "url": "https://scholar.google.com/scholar?cluster=4145589707440879826&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=4145589707440879826"
    },
    {
      "title": "An automatic cascaded approach for pancreas segmentation via an unsupervised localization using 3D CT volumes",
      "year": "",
      "authors": "Suchi Jain and Geeta Sikka and Renu Dhir",
      "citations": 6,
      "journal": "Multimedia Systems",
      "abstract": "Automatic organ segmentation using computed tomography (CT) images can support radiologists while carrying out quantitative and qualitative analyses of various types of cancer in their early stages. This work is aimed at automating the segmentation of the pancreas using CT images, which would ultimately aid in the early detection of pancreatic cancer. The pancreas is a small and challenging organ for automatic segmentation due to its variability in shape, size, and position. The state-of-the-art convolution neural networks (CNNs) based approaches have reported acceptable outcomes for stable large organs, but limited results for small organs like the pancreas. Although CNNs based results are promising, they utilized the supervised approach for localization, which required annotations. Hence, to avoid the need for annotations during localization, a novel unsupervised localization approach is proposed. The …",
      "url": "https://link.springer.com/article/10.1007/s00530-023-01115-9",
      "citationUrl": "/scholar?hl=en&cites=3636354576593889421"
    },
    {
      "title": "Transfer Learning approach for analysis of epochs on Handwritten Digit Classification",
      "year": "",
      "authors": "Kamalpreet Kaur and Renu Dhir and Kuldeep Kumar",
      "citations": 6,
      "journal": "",
      "abstract": "In the broader area of machine learning, deep learning depicts a dramatic twist in enhancing the level of intelligence in the various machines. There is a plethora of parameters like weights, bias, number of hidden layers, activation function, and hyperparameters that are utilized for measuring the accuracy of a training model. The prominent form of hyperparameters that are essential for the training process and extracting information for taking decisions is known as Epochs. The enhancement of results is obtained by practicing on the pre-trained network architecture that includes GPU-based computation in the TPU chips. The paper uses the ResNet50 architecture network to train the ultra-deep neural networks for implementing multiclass image classification that is based on Transfer Learning uses a various number of hidden layers to classify handwritten digits and accuracies at different classes is judged by epochs …",
      "url": "https://ieeexplore.ieee.org/abstract/document/9478102/",
      "citationUrl": "/scholar?hl=en&cites=12358108948711143678"
    },
    {
      "title": "An energy efficient tdma based mac protocol for wireless body area networks",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 6,
      "journal": "",
      "abstract": "Wireless Sensor Networks (WSN) and Wireless Body Area Network (WBAN) combined together with modern health care systems are the future of healthcare practices. WBAN witness an upward interest in healthcare sector and is more advanced than any existing telemedicine system. WBAN is an upgraded version of WSN in which number of sensors used are very less in number as compared to WSN and used for monitoring health care. Energy utilization and network lifetime are the main two major challenges in WBAN as recharging and replace batteries of sensors attached to a human body may lead to one's uneasiness. In recent years, research has been focused on channel modelling, energy consumption, design of efficient medium access control (MAC) protocols for body area networks. For handling emergency data of networks, in this paper, we deployed in numerous practical WBAN scenarios using MAC …",
      "url": "https://ieeexplore.ieee.org/abstract/document/8703340/",
      "citationUrl": "/scholar?hl=en&cites=12706510749868417212"
    },
    {
      "title": "Software Clustering using Hybrid Multi-Objective Black Hole Algorithm.",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 6,
      "journal": "",
      "abstract": "Software clustering is the process of organizing software units into appropriate clusters so as to efficiently modularize complex program structure. In this paper, we investigate the use of hybrids of Black Hole algorithm (developed using weighted aggregation, auxiliary archive and Genetic Algorithm) to optimize multiple objectives for clustering of android mobile applications. It is empirically and statistically observed that multi-objective Black Hole algorithm when improved using Genetic Algorithm and auxiliary archive outperforms Two-Archive algorithm and its counterparts.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=df13601e3f26a3689fb332f40a9851663b5210e8",
      "citationUrl": "/scholar?hl=en&cites=3020768023502163974"
    },
    {
      "title": "Security analysis and performance evaluation of enhanced threshold proxy signature scheme based on RSA for known signers",
      "year": "",
      "authors": "Raman Kumar and Harsh Kumar Verma and Renu Dhir",
      "citations": 6,
      "journal": "International Journal of Computer Network and Information Security",
      "abstract": "An efficient threshold signature scheme solves the difficulties of the receiver to proof the approval of the document from the sender as well as detecting if the file has been altered by illegitimate parties. In these days there are plenty of signature schemes such as (t, n) threshold proxy signature scheme. The network is a shared medium so that the weakness security attacks such as eavesdropping, replay attack and modification attack. Thus, we have to establish a common key for encrypting/decrypting our communications over an insecure network. In this scheme, a (t, n) threshold proxy signature scheme based on RSA, any t or more proxy signers can cooperatively generate a proxy signature while t-1 or fewer of them can‟ t do it. The threshold proxy signature scheme uses the RSA cryptosystem to generate the private and the public key of the signers. Comparison is done on the basis of time complexity, space complexity and communication overhead. We compare the performance of four schemes: Hwang et al., Wen et al., Geng et al. and Fengying et al. with the performance of a scheme that has been proposed by the authors of this article earlier. In the proposed scheme, both the combiner and the secret share holder can verify the correctness of the information that they are receiving from each other. Therefore, the enhanced threshold proxy signature scheme is secure and efficient against notorious conspiracy attacks.",
      "url": "https://www.researchgate.net/profile/Renu-Dhir/publication/268270937_Security_Analysis_and_Performance_Evaluation_of_Enhanced_Threshold_Proxy_Signature_Scheme_Based_on_RSA_for_Known_Signers/links/55dd468908ae591b309acbfb/Security-Analysis-and-Performance-Evaluation-of-Enhanced-Threshold-Proxy-Signature-Scheme-Based-on-RSA-for-Known-Signers.pdf",
      "citationUrl": "/scholar?hl=en&cites=18101672444497204355"
    },
    {
      "title": "A new technique for line segmentation of handwritten Hindi text",
      "year": "",
      "authors": "Saiprakash Palakollu and Renu Dhir and Rajneesh Rani",
      "citations": 6,
      "journal": "Special Issue of International Journal of Computer Applications",
      "abstract": "This paper mainly deals with the new method for line segmentation of Handwritten Hindi text. Line segmentation is the major task in segmentation process. If line segmentation fails word segmentation and character segmentation fails automatically. In this paper we have discussed an algorithm to detect header line and base lines accurately so that we can divide the lines correctly. The average line height is estimated, before calculating the header line and base lines. Performance of this method is checked on the 500 lines of different handwritten documents.",
      "url": "https://scholar.google.com/scholar?cluster=13959937813635138893&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=13959937813635138893"
    },
    {
      "title": "Comparative analysis of Gabor and discriminating feature extraction techniques for script identification",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Gurpreet Singh Lehal",
      "citations": 6,
      "journal": "",
      "abstract": "A considerable amount of success has been achieved in developing monolingual OCR systems for Indian Scripts. But in a country like India, where many languages and scripts exist, it is more common that a single document contain words from more than one script. Therefore a script identification system is required to select the appropriate OCR. This paper presents a comparative analysis of two different feature extraction techniques for script identification of each word. In this work, for script identification discriminating and Gabor filter based features are computed of Punjabi words and English numerals. Extracted feature are simulated with Knn and SVM classifiers to identify the script and then recognition rates are compared. It has been observed that by selecting the appropriate value of k and appropriate kernel function with appropriate combination of feature extraction and classification scheme, there is …",
      "url": "https://link.springer.com/chapter/10.1007/978-3-642-19403-0_27",
      "citationUrl": "/scholar?hl=en&cites=8705747931240020299"
    },
    {
      "title": "MaSO: A tool for aiding the management of schedule overrun",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir and Vijay Kumar Mago and Rajinder Singh Minhas",
      "citations": 6,
      "journal": "",
      "abstract": "Curbing schedule slippage is a daunting task in software industry. This problem evolves mainly because of poor analysis of risk factors and their management. This paper aims to handle this predicament with the help of Influence Diagram (ID). The three main risk factors that adversely affect the schedule are creeping user requirements, requirement instability and use of unnecessary features in the project. An integration of impacts of these with experts' opinion and with the existing databases (consisting of probability of occurrence of risk factors) helped us to create an ID based system that is capable to model the schedule slippage. This system can be used by the software manager at any stage of software development.",
      "url": "https://ieeexplore.ieee.org/abstract/document/5422909/",
      "citationUrl": "/scholar?hl=en&cites=200565888300983999"
    },
    {
      "title": "Chronic lymphocytic leukaemia manifestating as exfoliative dermatitis.",
      "year": "",
      "authors": "R Dhir",
      "citations": 6,
      "journal": "Indian Journal of Dermatology, Venereology and Leprology",
      "abstract": "A 60-year-old patient reported with a history of redness and peeling of the skin, and sensations of chills and tightness of the skin of three months duration. Clinical examination revealed exfoliative dermatitis, generalised lymphadenopathy and hepatosplenomegely. A peripheral smear showed features of chronic lymphocytic leukaemia.",
      "url": "https://europepmc.org/article/med/20952904",
      "citationUrl": "/scholar?hl=en&cites=12187139692711147875"
    },
    {
      "title": "An unusual case of hip disability--(a case report).",
      "year": "",
      "authors": "PB Bhosale and RS Dhir and NC Tejwani",
      "citations": 6,
      "journal": "Journal of Postgraduate Medicine",
      "abstract": "An unusual case of postero-superior periarticular irritation of the hip joint of six months' duration due to an extension of a pre-sacral foreign body granuloma in an 18 year old unmarried girl is presented. Two wooden sticks which probably were inserted pervaginally by a village midwife to induce an abortion for an unwanted pregnancy had found its way to presacral region. The scanning of the vaginal fornix indicated a possible route through which the sticks might have been migrated.",
      "url": "https://journals.lww.com/jopm/fulltext/1989/35040/an_unusual_case_of_hip_disability___a_case.14.aspx",
      "citationUrl": "/scholar?hl=en&cites=1409759981023492219"
    },
    {
      "title": "Script identification for printed and handwritten Indian documents: An empirical study of different feature classifier combinations",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Deepti Kakkar and Nonita Sharma",
      "citations": 5,
      "journal": "International Journal of Image and Graphics",
      "abstract": "The identification of script in a document page image is the first step for an OCR system processing multi-script documents. In this multilingual/multiscript world, document processing systems relying on the OCR that need human involvement to select the appropriate OCR package is definitely undesirable and inefficient. The development of robust and efficient methods for automatic script identification of a document is a subject of major importance for automatic document processing in a multilingual/multiscript environment. Thus, the basic objective is to come up with some intuitive methods having straightforward implementation without compromising with efficiency. The aim of this work is to evaluate state-of-the-art feature extraction and classification techniques in the field of automatic script identification of printed and handwritten documents and to propose the best combination for the same.",
      "url": "https://www.worldscientific.com/doi/abs/10.1142/S0219467821400118",
      "citationUrl": "/scholar?hl=en&cites=4275560766793635605"
    },
    {
      "title": "A stress testing web-based framework for automated malware analysis",
      "year": "",
      "authors": "Gurdip Kaur and Renu Dhir and Maninder Singh",
      "citations": 5,
      "journal": "Journal of Information and Optimization Sciences",
      "abstract": "Polymorphic malware pose a serious threat to cyber security especially if it is a zeroday. They are self-mutating and change their signatures at every run. Due to their dynamic behavior at execution time, antivirus solutions may not be able to detect them. Thus, it is utmost important to detect and analyze these malware samples. To address it, we created a polymorphic malware, analyzed it in a sandbox (a web-based framework to perform live code analysis in a controlled/isolated environment) and finally tested the framework. The framework analyzes files, registry keys, network traffic and behavior of PE (Portable Executable) file and helps to detect if it is packed or not. We used stress testing technique to test the framework for efficiency in successfully analyzing N malware samples in first attempt.",
      "url": "https://www.tandfonline.com/doi/abs/10.1080/02522667.2017.1372139",
      "citationUrl": "/scholar?hl=en&cites=11671660079721185101"
    },
    {
      "title": "Software module clustering using bio-inspired algorithms",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 5,
      "journal": "",
      "abstract": "Nature has always been a source of inspiration for human beings. Large numbers of complex optimization problems have been solved by the techniques inspired by nature. Software modularization is one of such complex problems that have been encountered by software engineers. It is the process of organizing modules of a software system into optimal clusters. In this chapter, some bio-inspired algorithms such as bat, artificial bee colony, black hole and firefly algorithm have been proposed for the cause of software modularization. The hybrid of these algorithms with crossover and mutation operators of the genetic algorithm has also been proposed. All the algorithms along with their hybrids are tested on seven benchmark open source software systems. It has been evaluated from the results thus obtained that the hybrid of these algorithms proved to optimize better than the existing genetic and hill-climbing …",
      "url": "https://www.igi-global.com/chapter/software-module-clustering-using-bio-inspired-algorithms/147525",
      "citationUrl": "/scholar?hl=en&cites=11714638962246592056"
    },
    {
      "title": "A novel hybrid technique for sub-pixel edge detection using fuzzy logic and zernike moment",
      "year": "",
      "authors": "Jyoti Bala and Renu Dhir",
      "citations": 5,
      "journal": "International Journal of Computer Sciences and Engineering",
      "abstract": "This paper is based on the development of fuzzy Logic based edge detection techniques in digital images. The proposed technique used Sobel operator, Zernike moment operator, and Fuzzy inference system in combination for edge detection purpose. Edge is a boundary between two homogeneous regions. Edge detection refers to the process of identifying and locating sharp discontinuities in an image. In this paper, the main aim of edge detection technique is to filter out unnecessary, false and double edges in the final image.",
      "url": "https://scholar.google.com/scholar?cluster=6042154047226462120&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=6042154047226462120"
    },
    {
      "title": "Novel adaptive neuro-fuzzy based edge detection technique",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 5,
      "journal": "International Journal of Computer Applications",
      "abstract": "Digital image processing is a subset of the electronic domain where the image is converted to an array of small integers, called pixels, symbolizing a physical quantity such as scene radiance, stored in a digital memory, and processed by computer or other digital hardware. Interest in digital image processing methods stems from two principals applications areas: improvement of pictorial information for human interpretation; and processing of image data for storage, transmission, and representation for autonomous machine perception. Edges characterize boundaries and edge detection is one of the most difficult tasks in image processing hence it is a problem of fundamental importance in image processing. Edges in images are areas with strong intensity contrasts and a jump in intensity from one pixel to the next can create major variation in the picture quality. Edge detection of an image significantly reduces the amount of data and filters out useless information, while preserving the important structural properties in an image.This research problem deals with a novel adaptive neuro-fuzzy inference system (ANFIS) for edge detection in digital images. The internal parameters of the proposed ANFIS edge detector are optimized by training using by proposed training pattern. The edges are directly determined by ANFIS network",
      "url": "https://www.academia.edu/download/77010973/pxc3880666.pdf",
      "citationUrl": "/scholar?hl=en&cites=14574443129487381942"
    },
    {
      "title": "Orbital neurofibrosarcoma: a case report",
      "year": "",
      "authors": "RAJENDER KUMAR TANWAR and RAKESH KUMAR and SUPADA MALIK and RAJIV DHIR and GOURA KISHORE RATH",
      "citations": 5,
      "journal": "Indian Journal of Pathology and Microbiology",
      "abstract": "Malignant peripheral nerve sheath tumours of orbit is rare entity. Only sixteen cases are reported in world literature. Bengin schwannomas of the orbit are found in 1.5 to 18 percent of patients with von Recklinghausen's disease (VRD) and form 1 percent of all orbital tumours 1. The incidence of malignant transformation in VRD is varies from 5-15 percent of all the cases1.",
      "url": "https://journals.lww.com/ijpm/abstract/1995/38010/orbital_neurofibrosarcoma___a_case_report.13.aspx",
      "citationUrl": "/scholar?hl=en&cites=7417006068803813785"
    },
    {
      "title": "Epithelioid sarcoma of the upper extremity (a case report).",
      "year": "",
      "authors": "BA Bhama and RS Dhir and AA Pandit",
      "citations": 5,
      "journal": "Journal of postgraduate medicine",
      "abstract": "Epitheloid sarcoma is a clinical curiosity with uncertain histogenesis.[1, 2, 4] It is slow growing and is often mistaken in early stages for benign affection due to its harmless appearance. One such case was under our treatment at the KEM Hospital and it forms the basis of this report.",
      "url": "https://journals.lww.com/jopm/fulltext/1987/33030/epithelioid_sarcoma_of_the_upper_extremity__a_case.9.aspx",
      "citationUrl": "/scholar?hl=en&cites=2213542655120645283"
    },
    {
      "title": "Handwritten Segmentation in Bangla script: A Review of Offline Techniques",
      "year": "",
      "authors": "C Jyoti Kumar and Gurpreet Singh and Rajneesh Rani and Renu Dhir",
      "citations": 4,
      "journal": "",
      "abstract": "Offline handwritten segmentation in Bangla is an interesting area of research as Segmentation has long been one of the most critical areas of optical character recognition process. Through this operation, an image of a sequence of characters, which may be connected in some cases, is decomposed into sub-images of individual alphabetic symbols. In this paper, segmentation of cursive handwritten script of world’s fourth popular language, Bangla is considered. A stateof-the-art survey about the techniques available in the area of offline handwriting recognition in Bangla scripts will be of a great aid to the researchers. So, a sincere attempt is made in this paper to discuss the advancements reported in this regard during the last few decades. The survey is organized into different sections. A brief introduction is given initially about automatic segmentation of handwriting Bangla scripts. Various Segmentation and classification techniques associated with the offline handwriting recognition of the Bangla scripts are discussed in this survey. A benchmarking database is very important for any pattern recognition related research. The details of the datasets available in Bangla script are also mentioned in the article. A separate section is dedicated to the observations made, future scope, and existing difficulties related to handwriting Segmentation in Bangla scripts. We hope that this survey will serve as a compendium not only for researchers in India, but also for policymakers and practitioners in India. Looking at the recent developments in optical handwritten Recognition of Bangla script, this article will provide a better platform for future research activities.",
      "url": "https://scholar.google.com/scholar?cluster=11142510421607708382&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=11142510421607708382"
    },
    {
      "title": "Feature extraction and classification for bilingual script (Gurmukhi and Roman)",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 4,
      "journal": "Proceedings of the third conference on IASTED International Conference: Advances in Computer Science and Technology",
      "abstract": "FEATURE EXTRACTION AND CLASSIFICATION FOR BILINGUAL SCRIPT (GURMUKHI AND \nROMAN) Renu Dhir Dr. BR Ambedkar National Institute of Technology Jalandhar, Punjab, \nINDIA 144011 renu_dhir@yahoo.com ABSTRACT The capability of recognizing multilingual \ndocuments is both novel and useful. With such capability, many applications can be supported \nincluding multilingual access to patent, business and regulatory information, translation, and \nkeyword finding in document images. The main purpose of our research will be development \nof the methodology of a single OCR system, which will process bilingual documents typed \nin both Gurmukhi (Punjabi) and Roman (English). The OCR will automatically recognize \nthe script of each word of the document and invoke the appropriate recognition engine and \nrecognize that word. KEY WORDS: Bilingual Script, segmentation, identification, projection …",
      "url": "https://www.actapress.com/abstract.aspx?paperid=30191",
      "citationUrl": "/scholar?hl=en&cites=14233684336656820613"
    },
    {
      "title": "Large myofascial fibromatosis involving the shoulder girdle",
      "year": "",
      "authors": "AR Bhaskar and RS Dhir and M Desai and AA Mistry",
      "citations": 4,
      "journal": "Journal of Postgraduate Medicine",
      "abstract": "An 11 year old girl presented with gradually increasing swelling over left scapular region and limitation of movements. On examination, a mass with firm to hard consistency was found fixed to the scapula. Clinical diagnosis of fibromatosis was confirmed by needle biopsy. Radical excision of the tumor was carried out and the resultant large exposed area was covered by transpositional rotation of trapezius myocutaneous flap. Microscopic examination of excised tumor revealed spindle shaped elongated cells in the form of whorls and trabeculae. The post operative course of the patient was uneventful with no evidence of recurrence at the end of 22 months.",
      "url": "https://journals.lww.com/jopm/fulltext/1994/40040/large_myofascial_fibromatosis_involving_the.11.aspx",
      "citationUrl": "/scholar?hl=en&cites=11655530573357602956"
    },
    {
      "title": "Empirical validation of object-oriented metrics on cross-projects with different severity levels",
      "year": "",
      "authors": "Aarti and Geeta Sikka and Renu Dhir",
      "citations": 3,
      "journal": "International Journal of Computational Systems Engineering",
      "abstract": "An object-oriented (OO) metrics has become crucial desideratum for software effort and fault predictions. To strengthen the adequacy of object-oriented metrics, it becomes important to know relationship between OO metrics and fault proneness at different levels of severity. It is inconceivable to build model of accurate estimate due to the inherent uncertainty in development projects. Empirical validation of software metrics is essential issue to determine applicability of prediction model. In this study, empirical validation is done on OO metrics given by Chidamber and Kemerer (CK suite) for predicting faults at different severity levels. This paper also instanced on defect prediction using cross-projects (CP) because of the unpredictability in selection of software attributes by analogy-based approach that deliver imprecise and ambiguous solution. This paper depicts detection of fault-proneness by extracting the relevant …",
      "url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJCSYSE.2019.103647",
      "citationUrl": "/scholar?hl=en&cites=16333098013813699609"
    },
    {
      "title": "An investigation on the metric threshold for fault-proneness",
      "year": "",
      "authors": "Geeta Sikka and Renu Dhir",
      "citations": 3,
      "journal": "International Journal of Education and Management Engineering",
      "abstract": "The software quality can be enhanced with the awareness and compassionate about the software faults. We acknowledge the impact of threshold of the object-oriented metrics on fault-proneness. The prediction of fault-prone classes in early stage of the life-cycle assures you to allocate the resources effectively. In this paper, we proposed the logistic regression based statistical method and metric threshold to reduce the false alarm for projects that fall outside the risk range. We presented the threshold effects on public datasets collected from the NASA repository and validated the use of threshold on ivy and jedit datasets. The results concluded that proposed methodology achieves the speculative results with projects having similar characteristic.",
      "url": "https://search.proquest.com/openview/6b1a610405dd991ee22a0f190046f8f3/1?pq-origsite=gscholar&cbl=2069183",
      "citationUrl": "/scholar?hl=en&cites=8215356139022870893"
    },
    {
      "title": "Watermarking for health management system",
      "year": "",
      "authors": "Vineet Mehan and Renu Dhir and YS Brar",
      "citations": 3,
      "journal": "Int. J. Adv. Res. Comput. Sci. Softw. Eng",
      "abstract": "Watermarking advances have conveyed efficient developments in health management system. An enormous volume of medical information is to be proficiently stored, retrieved, and circulated. This has led to the amplified security threats that have to be addressed explicitly. In this paper legitimacy of the patient and reliability of the medical image is maintained while circulating images over internet. Patient details and image information are converted to message digest using Secure Hash Algorithm (SHA). Advanced Encryption Standard (AES) is then applied to generate encrypted authentication code. Generated code is implanted using Discrete Cosine Transform (DCT) methodology. Embedding of authentication code certifies image veracity with respect to a specific patient. Analysis of quantitative parameters reveals the effectiveness of the proposed approach.",
      "url": "https://scholar.google.com/scholar?cluster=16454009689873580505&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=16454009689873580505"
    },
    {
      "title": "Novel edge detection using adaptive neuro-fuzzy inference system",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 3,
      "journal": "Int J Comput Appl",
      "abstract": "This paper proposes the implementation of a very simple but efficient Adaptive Neuro-Fuzzy Inference System (ANFIS) based algorithm to detect the edges of an gray scale image. The proposed approach begins by scanning the images using floating 3x3 pixel window. ANFIS system designed has 8 inputs, which corresponds to 8 pixels of instantaneous scanning matrix, one output that tells whether the pixel under consideration is “edge” pixel or a background pixel. The internal parameters of the proposed ANFIS edge detector are optimized by training using a proposed dataset. The edges are directly determined by ANFIS network. The results of proposed method are compared with the linear Sobel operator and Roberts operator.",
      "url": "https://scholar.google.com/scholar?cluster=263380648577271834&hl=en&oi=scholarr",
      "citationUrl": "/scholar?hl=en&cites=263380648577271834"
    },
    {
      "title": "Novel approach: Recognition of Devanagari handwritten numerals",
      "year": "",
      "authors": "Mahesh Jangid and Renu Dhir and Rajneesh Rani",
      "citations": 3,
      "journal": "International Journal of Electrical, Electronics and Computer Science (IJEECS)",
      "abstract": "Recognition of Indian languages scripts is challenging problems. In Optical Character Recognition [OCR], a character or symbol to be recognized can be machine printed or handwritten characters/numerals. There are several approaches that deal with problem of recognition of numerals/character depending on the type of feature extracted and different way of extracting them. In this paper an automatic recognition system for isolated Handwritten Devanagari Numerals has been proposed. The proposed system relies on a feature extraction technique based on recursive subdivision of the character image so that the resulting sub-images at each iteration have balanced numbers of foreground pixels as possible. Support Vector Machine (SVM) is used for classification. Accuracy of 98.98% has been obtained by using standard dataset provided by ISI (Indian Statistical Institute) Kolkata",
      "url": "https://maheshjangid.wordpress.com/wp-content/uploads/2011/05/ijeecs-numeral-new.pdf",
      "citationUrl": "/scholar?hl=en&cites=9704949270176338636"
    },
    {
      "title": "Deep learning based hybrid ghost-net for metaspread chromosome image segmentation",
      "year": "",
      "authors": "Kamalpreet Kaur and Renu Dhir",
      "citations": 2,
      "journal": "Biomedical Signal Processing and Control",
      "abstract": "Karyotyping is an important process in chromosome segmentation and classification to identify defected chromosomes. In this paper, a novel deep learning based Hybrid ghost-Net (DLH-GN) model is presented for effective chromosome segmentation from metaspread images. Initially, the input images contain some noises like intermodulation noise, which is denoised and deblurred using the Generative Adversarial Network (GAN) model. Additionally, the contrast in the images can be enhanced by the Quadrant Histogram intensity values (QHIV) mechanism to improve the quality of the images. The pre-processed output is passed into hybrid Ghost-UNet to segment the chromosome effectively. The segmentation of chromosomes helps to identify the genetic disease earlier. Finally, the loss function in the model and the hyperparameter tuning can be optimized by hybrid adaptive remora with dipper throated …",
      "url": "https://www.sciencedirect.com/science/article/pii/S1746809424003562",
      "citationUrl": "/scholar?hl=en&cites=2095077306387535771"
    },
    {
      "title": "Random projection-based cancelable iris biometrics for human identification using deep learning",
      "year": "",
      "authors": "Rajneesh Rani and Renu Dhir and Kirti Sonkar",
      "citations": 2,
      "journal": "Arabian Journal for Science and Engineering",
      "abstract": "Cancelable biometrics serves as an effective countermeasure against various template attacks launched by intruders, safeguarding the biometric system. This paper proposes a cancelable approach with a novel feature extraction technique for iris recognition, known as the hybrid architecture of the convolutional neural network (CNN) and GRU (gated recurrent unit). To provide cancelability to the system, the paper makes use of a random projection technique. The proposed method has the best outcome in terms of accurate identification. The method is validated on two Iris datasets IITD and MMU, which show promising results on the equal error rate (EER) and accuracy. The proposed model provides 0.02 and 0.045 EER for IITD and MMU, respectively, and accuracy 0.98 and 0.933%, for IITD and MMU Iris dataset, respectively, which is very high compared to other methodologies. The proposed hybrid architecture …",
      "url": "https://link.springer.com/article/10.1007/s13369-023-08190-0",
      "citationUrl": "/scholar?hl=en&cites=4808842650574848468"
    },
    {
      "title": "Iris recognition using transfer learning of inception v3",
      "year": "",
      "authors": "Kirti Sonkar and Rajneesh Rani and Renu Dhir",
      "citations": 2,
      "journal": "",
      "abstract": "Iris Biometrics recognition is one of the frequent identification techniques. It can provide a high degree of assurance to a person’s identity. In an iris recognition system feature extraction is the most important stage. Various types of feature extraction techniques are used to carry out Iris recognition systems. Many hand-made feature extraction techniques are involved in the production of biometric systems by experts. Thanks to the introduction of deep learning techniques in object recognition problems, CNN (Convolutional Neuron Network) has been able to acquire a lot of attention in the field of the iris recognition system. This paper proposed a productive iris recognition scheme with the transfer learning technique of InceptionV3. The implementation of the proposed system is based on the development of fine-tuning of a pre-trained CNN (Inception-v3) for the feature extraction and classification. The proposed …",
      "url": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781003269793-55/iris-recognition-using-transfer-learning-inception-v3-kirti-sonkar-rajneesh-rani-renu-dhir",
      "citationUrl": "/scholar?hl=en&cites=13312381597654218788"
    },
    {
      "title": "Novel transportation layers of NiO and ZnO for the fabrication of perovskite solar cell for e-monitoring of healthcare",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 2,
      "journal": "Journal of Sol-Gel Science and Technology",
      "abstract": "Inorganic n-type NiO and p-type ZnO has been used as hole transport layers (HTL) and electron transport layers (ETL), respectively, for the fabricated perovskite solar cells. The sols of NiO and ZnO have been synthesized using sol–gel method. The structural, morphological, and optical analysis of the synthesized ZnO and NiO nanoparticles prepared from sol has been done. The spin coating technique was used for the fabrication of HTL, ETL, and perovskite layers. The thickness of the fabricated solar cell is about 2 μm. The current density versus voltage (JV) characteristics of the fabricated solar cell was investigated. The JV characteristics revealed the value of various parameters such as short-circuit current density (JSC), open-circuit voltage (VOC), fill factor (FF), power conversion efficiency, and maximum power (Pmax) is 15.90 mA/cm2, 0.93 V, 73%, 10.70%, and 10.70 W, respectively. The fabricated solar …",
      "url": "https://link.springer.com/article/10.1007/s10971-020-05320-0",
      "citationUrl": "/scholar?hl=en&cites=10180368395685398669"
    },
    {
      "title": "An Energy Efficient Health Monitoring System using Relay Node in Wireless Body Area Networks",
      "year": "",
      "authors": "Naveen Bilandi and Harsh K Verma and Renu Dhir",
      "citations": 2,
      "journal": "EAI Endorsed Transactions on Pervasive Health and Technology",
      "abstract": "INTRODUCTION: In today's world, Wireless Body Area Networks (WBAN) has emanated as a budding field within the healthcare scenario for monitoring, detecting, predicting, and diagnosing various fatal diseases such as cancer, cardiovascular, diabetes and other infectious diseases such as tuberclosis, pneumonia and ebola. It is an assemblage of bio-sensors which could be put on or embedded in a patient's body to surveil the functionality of various body organs.OBJECTIVES: The purpose of that proposed protocol is to select the relay node and record the various physiological parameters like body temperature, blood pressure, rate of blood sugar of human being. Energy consumption is a major hurdle in WBAN as replacing as well as recharging the nodes pinioned to human body may bring about discomfort to the patient. Therefore, in this work, the emphasis is given to improve the performance of WBAN ie network lifetime, greater mobility, stability and energy efficiency.METHODS: To find the shortest energy-efficient route and avoid any kind of relay node failure, a novel routing scheme called Enhanced Opportunistic Protocol using Relay nodes (E-OPR) is proposed for data routing.CONCLUSION: Finally, an enhanced opportunistic protocol using relay node in WBAN has been proposed for cost effective real time health monitoring system. The proposed solution seems to give better results as compare single-hop, multi-hop routing protocols in terms of throughput, network lifetime, energy consumption and path loss.",
      "url": "https://publications.eai.eu/index.php/phat/article/view/1253",
      "citationUrl": "/scholar?hl=en&cites=5031934259227405556"
    },
    {
      "title": "Face Recognition using SIFT Key with Optimal Features Selection Model",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 2,
      "journal": "International Journal of Advanced Computer Science and Applications",
      "abstract": "Facial expression is complex in nature due to legion of variations present. These variations are identified and recorded using feature extraction mechanisms. The researchers have worked towards it and created classifiers for identifying face expression. The classifiers involve Principal component analysis (PCA), Local Polynomial approximation (LPA), Linear binary pattern (LBP), Discrete wavelet transformation (DWT) etc. The proposed work deals with the new classifier using SIFT key with genetic algorithm to identify distinct facial expression. Optimal features of existing algorithms are used within the proposed work. Also comparison of existing techniques such as LBP, PCA and DWT is presented with SIFT key with genetic algorithm. The results show that proposed classifier gives better result in terms of recognition rate.",
      "url": "https://pdfs.semanticscholar.org/8364/04a86c3fe1fef445acdd27d2c56eacd01284.pdf",
      "citationUrl": "/scholar?hl=en&cites=14021542545305990285"
    },
    {
      "title": "Bi-criteria parallel machine scheduling using nature-inspired hybrid flower pollination algorithm",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir and Sameer Sharma",
      "citations": 2,
      "journal": "International Journal of Metaheuristics",
      "abstract": "Parallel machine scheduling and its complex combinatorial optimisation problems are widely studied. A lot of research has been carried out in this area to determine how to effectively schedule parallel execution of different jobs to be carried out using different machines in order to achieve the optimisation criteria. In this paper, the formulations of multi-objective flower pollination algorithm obtained by the combination of weighted objectives or secondary storage for managing possible solutions along with their hybrids with genetic algorithm have been developed and applied to the problem of scheduling jobs on machines running in parallel in order to optimise bi-criteria, namely, maximum tardiness and weighted flow time. It has been empirically verified that multi-objective flower pollination algorithm using secondary storage and hybridised with genetic algorithm leads to better results as compared to the existing …",
      "url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJMHEUR.2016.081153",
      "citationUrl": "/scholar?hl=en&cites=15018900814272977700"
    },
    {
      "title": "A Non-domination Pareto-based Scale-Invariant Approach for Face Recognition",
      "year": "",
      "authors": "Taqdir Kaur and Renu Dhir",
      "citations": 2,
      "journal": "European Journal of Engineering and Technology Research",
      "abstract": "Human face recognition has presented a major challenge to the researchers from different domains enabling to enhance the security and pattern analysis. The different orientations, lighting, pose and facial expression of a human face constructs an array of similar images with variations. The identification of face under different circumstances has been the focus of the researchers from a decade to the present time. For face recognition higher the number of feature may not lead to high recognition rate. Hence, the selection of the optimum features becomes primary concern. It reduces the feature size and increases the recognition rate. Many algorithms have been proposed that fulfilled the goal of face recognition system but also comprises of some drawbacks. In this paper a novel Pareto-Optimized Evolutionary Approach with Scale Invariance Discrimination has been proposed. The algorithm extracts the set of relevant features from the given image. The optimization of the features is performed for finding the features that enhances the recognition rate. The algorithm performs the classification of the test image, given the set of training images to obtain the accuracy of human face identification. The recognition rate is evaluated to show the performance of the proposed approach with conventional methods.",
      "url": "https://www.ej-eng.org/index.php/ejeng/article/view/124",
      "citationUrl": "/scholar?hl=en&cites=11045341348862098460"
    },
    {
      "title": "Digital image mosaicing using optimized KD-tree search",
      "year": "",
      "authors": "Shubham Shukla and Renu Dhir and Ms Rajneesh Rani",
      "citations": 2,
      "journal": "Int. J. Eng. Res. Technol",
      "abstract": "Field of view of an image capturing hardware is smaller than our own field of view due to limitations of hardware. For capturing field of view as human eye, concept of image mosaicing comes. Image mosaicing is referred to the process of combining multiple partially overlapped images, in order to generate a larger field of view. Feature based image mosaicing using KD-tree suffer from the backtracking issue of nearest neighbor search. In this proposed method, optimization of KD-tree is used to remove backtracking problem which also makes the execution faster.",
      "url": "https://www.academia.edu/download/102985220/digital-image-mosaicing-using-optimized-kd-tree-search-IJERTV3IS080165.pdf",
      "citationUrl": "/scholar?hl=en&cites=11530457170092782243"
    },
    {
      "title": "A model for estimating efforts required to make changes in a software development project",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 2,
      "journal": "",
      "abstract": "Research on software quality is as old as software project management. As in other engineering and science disciplines, one approach to understand and control this issue is the use of models. These, quality models have become a well-accepted means to describe and manage software quality. Statistical techniques like Bayesians Networks are used to access and predict software quality by using these quality models. But they are not very accurate. These models lack clarity and operation. In this paper, we propose to develop software model that uses a fuzzy inference approach to access and predict software quality. This model indicates the impact of implementation, quality assurance and analysis on maintenance (an important factor for measuring quality) and the result is studied by the impact on indicator like average efforts required to maintain a project.",
      "url": "https://dl.acm.org/doi/abs/10.1145/2007052.2007088",
      "citationUrl": "/scholar?hl=en&cites=8124308870535067109"
    },
    {
      "title": "Analyzing Image Filtrations by Enhanced Fuzzy Logic with Multi Quality Inputs",
      "year": "",
      "authors": "Ramesh Tiwari and Renu Dhir",
      "citations": 2,
      "journal": "International Journal of Computer Applications",
      "abstract": "In this paper, we describe the Image Filtration through Fuzzy Logics in four different scenarios of Image Input as 3* 3, 9* 9, 17* 17 and 25* 25 division blocks and iterating fuzzy equation on it for 2 and 8 times at constant amplification factor of 10. The input image selected for analysis is PGM (Portable Gray Map), dividing input images into matrix of m* n blocks. The input image is analyzed for multiple iterations and difference in output is significantly marked for MSE and PSNR.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=8c6e7841caa320f088bdca1e8764359a6f62165d",
      "citationUrl": "/scholar?hl=en&cites=1136689850562069577"
    },
    {
      "title": "Design of Network Forensic System Based on Honeynet",
      "year": "",
      "authors": "Rajani Misra and Renu Dhir",
      "citations": 2,
      "journal": "Int. J. Innov. Eng. Technol",
      "abstract": "Network forensics deals with the capturing and analysis of the trace and logs of network intrusions from the multiple systems for providing the information to characterize intrusion or features. This paper demonstrates the internal working of implementation of server honeypot technology and network forensics. Honeypot based system is used to attract the attackers so that their process methodology can be observed and analyzed to improve defense mechanisms. Network Forensic allow administrators to monitor the networks, gather all the intelligent information about all the abnormal traffic, and helps to collect the attack evidence for network forensics. A prototype system have been developed to collect the network logs using honeynet infrastructure and analyze all the logged traffic, which is highly malicious in nature with large volume of attacker’s information. The end result of the system is to collect network data which are highly malicious in nature and which can be used for further investigation to get the intelligent information about the attackers as evidence for Network Forensics.",
      "url": "https://www.academia.edu/download/81010374/3.pdf",
      "citationUrl": "/scholar?hl=en&cites=8437711609258909248"
    },
    {
      "title": "Unleashing the prospective of blockchain-federated learning fusion for IoT security: A comprehensive review",
      "year": "",
      "authors": "Mansi Gupta and Mohit Kumar and Renu Dhir",
      "citations": 1,
      "journal": "",
      "abstract": "Internet-of-things (IoT) is a revolutionary paragon that brings automation and easiness to human lives and improves their experience. Smart Homes, Healthcare, and Agriculture are some of their amazing use cases. These IoT applications often employ Machine Learning (ML) techniques to strengthen their functionality. ML can be used to analyze sensor data for various, including optimizing energy usage in smart homes, predicting maintenance needs in industrial equipment, personalized user experiences in wearable devices, and detecting anomalies for security monitoring. However, implementing centralized ML techniques is not viable because of the high cost of computing power and privacy issues since so much data is stored over a cloud server. To safeguard data privacy, Federated Learning (FL) has become a new paragon for centralized ML methods where FL,an ML variation sends a model to the user …",
      "url": "https://www.sciencedirect.com/science/article/pii/S1574013724000698",
      "citationUrl": "/scholar?hl=en&cites=14941168485257138319"
    },
    {
      "title": "View adaptive unified self-supervised technique for abdominal organ segmentation",
      "year": "",
      "authors": "Suchi Jain and Renu Dhir and Geeta Sikka",
      "citations": 1,
      "journal": "Computers in Biology and Medicine",
      "abstract": "Automatic abdominal organ segmentation is an essential prerequisite for accurate volumetric analysis, disease diagnosis, and tracking by medical practitioners. However, the deformable shapes, variable locations, overlapping with nearby organs, and similar contrast make the segmentation challenging. Moreover, the requirement of a large manually labeled dataset makes it harder. Hence, a semi-supervised contrastive learning approach is utilized to perform the automatic abdominal organ segmentation. Existing 3D deep learning models based on contrastive learning are not able to capture the 3D context of medical volumetric data along three planes/views: axial, sagittal, and coronal views. In this work, a semi-supervised view-adaptive unified model (VAU-model) is proposed to make the 3D deep learning model as view-adaptive to learn 3D context along each view in a unified manner. This method utilizes the …",
      "url": "https://www.sciencedirect.com/science/article/pii/S0010482524007443",
      "citationUrl": "/scholar?hl=en&cites=11449040265838496117"
    },
    {
      "title": "Automatic Detection of Cloudy and Non-Cloudy SAR Images Using Convolutional Neural Networks",
      "year": "",
      "authors": "Shaikh Siddiq and Kamalpreet Kaur and Renu Dhir",
      "citations": 1,
      "journal": "",
      "abstract": "Cloud detection in satellite images has a number of benefits as it helps in weather and climate research Clouds may alter the Earth's atmosphere system energy by scattering and absorbing shortwaves and absorption and re-emission of infrared light. The microphysical features of clouds, which govern their scattering and absorption qualities, determine the type of cloud. As a result, recognizing the existence of clouds over a region in satellite images is critical for obtaining atmospheric data such a s depth, phase, temperature, and many more that may be used to understand weather and climate processes. Our proposed algorithm utilizes a dataset of labeled images, which is used totrain the CNN to accurately classify images as cloudy or non-cloudy. The dataset is combining various satelliteimages and manually annotates the presence of clouds. TheCNN design incorporates various convolution and pooling …",
      "url": "https://ieeexplore.ieee.org/abstract/document/10176417/",
      "citationUrl": "/scholar?hl=en&cites=15946350418828662625"
    },
    {
      "title": "SSAMH–A Systematic Survey on AI‐Enabled Cyber Physical Systems in Healthcare",
      "year": "",
      "authors": "Kamalpreet Kaur and Renu Dhir and Mariya Ouaissa",
      "citations": 1,
      "journal": "Convergence of Cloud with AI for Big Data Analytics: Foundations and Innovation",
      "abstract": "In the former period, technology connects the devices for resourceful interaction, still in an atmosphere of various concerns like trust, privacy, and security. Nowadays in the real world, various protruding systems are trying their level best for creating a secure communication environment with a set of protocols. Artificial intelligence‐driven healthcare systems are integrated with automatic decision‐making systems that take appropriate decisions regarding the patient's health. It follows the physiological closed‐loop interoperable system to control the input and output parameters of health. So, the health security of the patient should be sustained with proper security measures.The electronic healthcare systems transmit data and perform monitoring over the numerous communication media using low‐cost sensors and intelligent devices such as smart meters …",
      "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781119905233.ch13",
      "citationUrl": "/scholar?hl=en&cites=1797683278343555905"
    },
    {
      "title": "Heart Disease Prediction Using Stacking Ensemble Model Based on Machine Learning Approach",
      "year": "",
      "authors": "Saurabh Verma and Renu Dhir and Mohit Kumar",
      "citations": 1,
      "journal": "",
      "abstract": "Cardiovascular diseases (CVDs), also known as heart disease, are the leading cause of death globally in recent decades and have emerged as the most lethal disease globally. According to the WHO, heart disease causes 17.7 million deaths worldwide, or 31% of all deaths. Machine learning-based algorithms play a vital role in the field of heart disease prediction. Heart disease classification can be performed in various ways, like KNN, Decision Tree, SVM, Xtreme gradient boost, Naıve Bayes, Random Forest, and LGBM classifier. Hence, we have proposed a stacking ensemble model for heart disease prediction that will improve the overall quality of the classification of heart disease in the paper. In this model, we used two-layer stacking (Level 0 and Level 1) Ensemble, where level 0 models learn to make predictions from the input training dataset, and the output from the level 0 models is taken as input in level 1 …",
      "url": "https://link.springer.com/chapter/10.1007/978-981-99-3432-4_26",
      "citationUrl": "/scholar?hl=en&cites=14146510355942177697"
    },
    {
      "title": "Fog computing: An overview of IoT applications with security issues and challenges",
      "year": "",
      "authors": "Nonita Sharma and Renu Dhir",
      "citations": 1,
      "journal": "",
      "abstract": "IoT (The Internet of Things) introduces a revolution into the internet and hardware business, which through sharing information connect one device to another. These IoT devices are connected with a cloud platform for several tasks, including monitoring, categorization, management and control, storage, prediction, etc. Despite all of these features, there is no real-time analysis, in-hour processing and computing, flexibility, interoperability and so on. Fog Computing is an expansion of the cloud to address IoT problems and give a decentralized method. It is connected with cloud as well as end-user to overcome the unsupported features of IoT. These Fog nodes are mobile in nature, connected with multiple local network, local storage can make them more vulnerable where attacker can easily access the information and breach the security. This paper overview the various security issues and real-time applications with …",
      "url": "https://ieeexplore.ieee.org/abstract/document/9596158/",
      "citationUrl": "/scholar?hl=en&cites=11409756847542550402"
    },
    {
      "title": "Design of dynamic morphological analyser for Hindi nouns using rule based approach",
      "year": "",
      "authors": "Ishan Kumar and Renu Dhir and Gurpreet S Lehal and Sanjeev Kumar Sharma",
      "citations": 1,
      "journal": "Recent Advances in Computer Science and Communications (Formerly: Recent Patents on Computer Science)",
      "abstract": "",
      "url": "https://www.ingentaconnect.com/content/ben/rascs/2020/00000013/00000006/art00011",
      "citationUrl": "/scholar?hl=en&cites=3153631127530857038"
    },
    {
      "title": "Restoration of Image from Deterioration Using Image Inpainting",
      "year": "",
      "authors": "Varuni Garg and Renu Dhir",
      "citations": 1,
      "journal": "",
      "abstract": "Inpainting is a technique used to reconstruct spoiled image or missing part of an image in original image in the way that look plausible according to human perception. This technique reconstructs the picture comes under inpainting. The rebuilding of damaged photos such as aged photos and films, elimination of superimposed text, elimination/replacement of not desired objects, red eye correction, image coding comes under the application of image inpainting. It is art which is used in the past years. In this paper, Convolutional Method has been used to inpaint the image. In proposed method the diffusion kernel has been modified and the number of kernel has been increased from both left and right direction and the kernels has been convolved upon the area needed to be inpaint.",
      "url": "https://ieeexplore.ieee.org/abstract/document/8703203/",
      "citationUrl": "/scholar?hl=en&cites=2700507063259637137"
    },
    {
      "title": "A Bi-Criteria Hybrid Grey Wolf Approach for Parallel Machine Job Scheduling",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 1,
      "journal": "International Journal of Applied Metaheuristic Computing (IJAMC)",
      "abstract": "Nature-inspired algorithms are becoming popular due to their ability to solve complex optimization and engineering problems. Grey Wolf algorithm is one of the recent nature-inspired algorithms that have obtained inspiration from leadership hierarchy and hunting mechanisms of grey wolves. In this paper, four formulations of multi-objective grey wolf algorithm have been developed by using combination of weighted objectives, use of secondary storage for managing possible solutions and use of Genetic Algorithm (GA). These formulations are applied for jobs scheduling on parallel machines while taking care of bi-criteria namely maximum tardiness and weighted flow time. It has been empirically verified that GA based multi-objective Grey Wolf algorithms leads to better results as compared to their counterparts. Also the use of combination of secondary storage and GA further improves the resulting schedule. The …",
      "url": "https://www.igi-global.com/article/a-bi-criteria-hybrid-grey-wolf-approach-for-parallel-machine-job-scheduling/178480",
      "citationUrl": "/scholar?hl=en&cites=4456239748368029802"
    },
    {
      "title": "Meta-Heuristic Algorithms to Solve Bi-Criteria Parallel Machines Scheduling Problem",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir and Sameer Sharma",
      "citations": 1,
      "journal": "International Journal of Applied Evolutionary Computation (IJAEC)",
      "abstract": "Parallel machine scheduling problems are classified as NP-hard problems. The direct solutions for these problems are not available and meta-heuristic algorithms are required to be used to find near-optimal solutions. In this paper, the formulations of multi-objective Artificial Bee Colony algorithm by using combination of weighted objectives, secondary storage for managing possible solutions and Genetic algorithm have been developed and applied to schedule jobs on parallel machines optimizing bi-criteria namely maximum tardiness and weighted flow time. The results obtained indicate that proposed algorithm outperforms other multi-objective algorithms in optimizing bi-criteria scheduling problems on parallel machines. Further, the sequential optimization of bi-criteria using Early Due Date (EDD) followed by Genetic Algorithm (GA) has also been investigated. The efficiencies of the proposed algorithms have …",
      "url": "https://www.igi-global.com/article/meta-heuristic-algorithms-to-solve-bi-criteria-parallel-machines-scheduling-problem/157333",
      "citationUrl": "/scholar?hl=en&cites=5145233376968896114"
    },
    {
      "title": "Software re-engineering using imperialist competitive algorithm",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 1,
      "journal": "ACM SIGSOFT Software Engineering Notes",
      "abstract": "Maintenance is one of the important phases of the software development life cycle which contributes to the effective and long term use of any software system. It can become cumbersome and costly for software maintainers when subsystem boundaries are not clearly defined. Further, the problem gets worse due to the system evolution, lack of current documentation and lack of original design documentation. The application of clustering techniques and tools helps software maintenance programmers to recover high-level views of system designs and hence leads to better understanding and maintenance of software systems. In this paper, we have used a sociopolitical Imperialist Competitive Algorithm for software module clustering and compared it with existing evolutionary approaches. We conclude that the novel socio-political approach produces better quality clusters as compared to the earlier evolutionary …",
      "url": "https://dl.acm.org/doi/abs/10.1145/2532780.2532808",
      "citationUrl": "/scholar?hl=en&cites=9781826499017697835"
    },
    {
      "title": "A comparative study of Bayesian and fuzzy inference approach to assess quality of the software using activity-based quality model",
      "year": "",
      "authors": "Kawal Jeet and Nitin Bhatia and Renu Dhir",
      "citations": 1,
      "journal": "",
      "abstract": "Maintainability is one of the important characteristics of quality of software. It is the measure of efforts needed to modify the software. Large number of subjective techniques has been developed in industry to deal with assessment or prediction of this characteristic. But these techniques generally fail due to their inability to break down maintainability to a level of actual evaluation. They also lack homogeneity in the models thus developed and so fail to take into account the cost factor associated with maintainability. Activity based quality model is found to decompose maintainability to an actual analyzable level. It manages maintainability in terms of software maintenance efforts but it lacks quantitative evaluation of this characteristic. Bayesian approach to deal with this model added quantitative feature but also added crispness to the system developed. In this chapter, the authors propose the use of fuzzy approach to …",
      "url": "https://www.igi-global.com/chapter/comparative-study-bayesian-fuzzy-inference/74876",
      "citationUrl": "/scholar?hl=en&cites=11865258882354393840"
    },
    {
      "title": "Secure electronic passport certification using re-water marking",
      "year": "",
      "authors": "Vineet Mehan and Renu Dhir and YS Brar",
      "citations": 1,
      "journal": "",
      "abstract": "A novel re-watermarking system is proposed for authenticating electronic passport by using Elliptic Curve Cryptography (ECC) applied in dual domain. The scheme splits the cover passport image into twin segments (S). Likewise the passport particulars are fragmented into two parts (P). P1 statistics are attached with the image data in S1 to create a multipart message. The message formed is digitally signed using Elliptic Curve Digital Signature Algorithm (ECDSA). The generated signature is inserted spatially by exploiting the Human Visual System (HVS) characteristics of S1. Implanting signature safeguards passport authentication and shields image veracity. P2 facts are encoded by means of Advanced Encryption Standard (AES) with key generated over Elliptic Curve Diffie Hellman Protocol (ECDHP). The encoded data is inserted using double Discrete Cosine Transform (DCT). Applying double DCT allows for …",
      "url": "https://digital-library.theiet.org/content/conferences/10.1049/cp.2013.2343",
      "citationUrl": "/scholar?hl=en&cites=4840671466132204009"
    },
    {
      "title": "A Review of Various Methods for Association Rule Mining.",
      "year": "",
      "authors": "Harpreet Singh and Renu Dhir and Munish Saini",
      "citations": 1,
      "journal": "",
      "abstract": "Association rule mining is the process of finding interesting relationships between various data elements. As the size of database is growing so rapidly, efficient methods are required for finding association rules. This paper presents a review of various known and recently developed methods for finding association rules. Followed by the comparison of different methods and specifying which method is more efficient from other.",
      "url": "https://search.ebscohost.com/login.aspx?direct=true&profile=ehost&scope=site&authtype=crawler&jrnl=09765697&AN=91876577&h=z2ZL6vTfAKIUxJmitTGwA4TlVMqXldF3BI5Fm66iWxIrcQrSp0Sv%2FAcKNjYQKV%2FhzkFJox9uQZy5Pz%2Fle6bHbw%3D%3D&crl=c",
      "citationUrl": "/scholar?hl=en&cites=5670022037926295063"
    },
    {
      "title": "An effective method for association rule mining based on transactional matrix",
      "year": "",
      "authors": "Harpreet Singh and Renu Dhir",
      "citations": 1,
      "journal": "International Journal of Computer Applications",
      "abstract": "Focus of this paper is to present a new method based on transactional matrix for finding association rules more efficiently. Apriori algorithm is one of the classical algorithms for finding association rules, but it has limitations of number of times database scanned is too large and number of candidate itemsets generated is large. To reduce these two limitations a new method tries to find the association rules directly from a matrix which is generated from the transactional database.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=41a9ea0ddd25a7e1863fef9c88703a33748bbaf1",
      "citationUrl": "/scholar?hl=en&cites=11070064216102196328"
    },
    {
      "title": "Comparative analysis of classifiers inaccuracies for bilingual characters (Gurmukhi and Roman)",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 1,
      "journal": "Proc. of International Conference on Contemporary Computing",
      "abstract": "Recognition of bilingual script in an image of a document page is of primary importance for a system processing bilingual document. In this paper two essential sub stages of recognition phase, feature extraction and classification has been discussed for segmented Gurmukhi and Roman characters. Structural and Statistical features have been proposed for machine printed bilingual characters. Three classifiers such as k-nearest neighbor (KNN), artificial neural networks (ANN) and Support Vector Machines (SVM) schemes have been proposed for analyzing the error rate for recognition. It has been found that error rate is dropped when statistical features are used simultaneously with structural features. It has also been observed that SVM outperform among all the classifiers.",
      "url": "http://www.jiit.ac.in/jiit/ic3/IC3_2008/ic3-2008/app4_36.pdf",
      "citationUrl": "/scholar?hl=en&cites=7942187857511115442"
    },
    {
      "title": "Brain Tumor Detection Analysis Using CNN: A",
      "year": "",
      "authors": "Sunil Kumar and Renu Dhir and Nisha Chaurasia",
      "citations": 1,
      "journal": "International Conference on Artificial Intelligence and Smart Systems.(ICAIS-2021)",
      "abstract": "A Brain Tumor is essentially a malformed cell growth that can be cancerous and non-cancerous. The tumor in the Brain is the most dangerous disease and can be diagnosed easily and reliably with the help of detection of the tumor with automated techniques on MRI Images. Several methods of efficient diagnosis and segmentation of brain tumors have been suggested by many researchers for effective tumor detection. A review method involving two-stage approaches for 20 research papers published in the period from 2000 to 2020 has been conducted to learn about tumor detection in MRI images. There has also been a comparative study of various processes. Two key problems are discovered after an intensive analysis procedure, Image Restoration and Image Enhancement. Which are solved and clarified with suitable methodologies. The introduction of quantitative image analysis resulted in fields such as MRI Images. On-going area for interest in brain tumors, in particular focus on White Matter, CSF, GM. The novel method uses the CNN classification technique and has been used to disregard the dataset picture algorithm error. The implementation of the suggested model is applied in the Python and TensorFlow environment. Algorithms and methodologies used to solve specific research problems were included in the results and along with their strengths and limitations. This examines the quantitative characteristics of brain tumors, such as shape, texture, and signal intensity, to predict high accuracy with a low error rate and the potential for future work in the field.",
      "url": "https://www.researchgate.net/profile/Sunil-Kumar-388/publication/350936249_Brain_Tumor_Detection_Analysis_Using_CNN_A_Review/links/6349cb459cb4fe44f3282b92/Brain-Tumor-Detection-Analysis-Using-CNN-A-Review.pdf",
      "citationUrl": "/scholar?hl=en&cites=14393392286697372695"
    },
    {
      "title": "Implementation of Colored CAPTCHA",
      "year": "",
      "authors": "Mandeep Kumar and Renu Dhir",
      "citations": 1,
      "journal": "Assistant Professor, Dept of Computer Science SRPA Adarsh Bhartiya College, Pathankot Dr. Renu Dhir Associate Professor, Dept of Computer Science NIT-Jalandhar",
      "abstract": "Completely Automated Public Turing test to tell Computers and Humans Apart. The purpose of a CAPTCHA is to block form submissions from spam bots–automated scripts that harvest email addresses from publicly available web forms. We introduce a new CAPTCHA which is based on identifying the color of image, object or background. This actually requires analysis of complex contents of image, which humans usually performs well but machines or robots usually do not. From a large database of images, we select many images which having single color. The main advantages of our CAPTCHA technique over the traditional text-based techniques are that it is languageindependent, does not require text-entry.",
      "url": "https://www.academia.edu/download/95099068/2642.pdf",
      "citationUrl": "/scholar?hl=en&cites=10470021803602260827"
    },
    {
      "title": "A systematic literature review on pancreas segmentation from traditional to non-supervised techniques in abdominal medical images",
      "year": "",
      "authors": "Suchi Jain and Geeta Sikka and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "Abdominal organs play a significant role in regulating various functional systems. Any impairment in its functioning can lead to cancerous diseases. Diagnosing these diseases mainly relies on radiologists’ subjective assessment, which varies according to professional abilities and clinical experience. Computer-Aided Diagnosis (CAD) system is designed to assist clinicians in identifying various pathological changes. Hence, automatic pancreas segmentation is a vital input to the CAD system in the diagnosis of cancer at its early stages. Automatic segmentation is achieved through traditional methods like atlas-based and statistical models, and nowadays, it is achieved through artificial intelligence approaches like machine learning and deep learning using various imaging modalities. This study investigates and analyses the various state-of-the-art multi-organ and pancreas segmentation approaches to identify the …",
      "url": "https://link.springer.com/article/10.1007/s10462-024-10966-1",
      "citationUrl": ""
    },
    {
      "title": "Spatio-temporal analysis and prediction of land use land cover (LULC) change in Wular Lake, Jammu and Kashmir, India",
      "year": "",
      "authors": "Monia Digra and Renu Dhir and Nonita Sharma",
      "citations": 0,
      "journal": "Environmental Monitoring and Assessment",
      "abstract": "Landsat land use/land cover (LULC) data analysis to establish freshwater lakes’ temporal and spatial distribution can provide a solid foundation for future ecological and environmental policy development to manage ecosystems better. Analysis of changes in LULC is a method that can be used to learn more about direct and indirect human interactions with the environment for sustainability. Neural network technology significantly facilitates mapping between asymmetric and high-dimensional data. This paper presents a methodological advancement that integrates the CA-ANN (cellular automata-artificial neural network) technique with the dynamic characteristics of the water body to forecast forthcoming water levels and their spatial distribution in “Wular Lake.” We used remote sensing data from 2001 to 2021 with a 10-year interval to predict spatio-temporal change and LULC simulation. The validation of the …",
      "url": "https://link.springer.com/article/10.1007/s10661-024-12928-0",
      "citationUrl": ""
    },
    {
      "title": "Digital Healthcare System Using Stacked Ensemble Machine Learning Model to Predict Heart Diseases",
      "year": "",
      "authors": "Saurabh Verma and Renu Dhir and Mohit Kumar and Mansi Gupta",
      "citations": 0,
      "journal": "",
      "abstract": "Cardiovascular diseases (CVDs) have emerged as the world’s most deadly disease in recent years and are the primary reason of death worldwide. An intelligent and improved system is required to detect heart disease in its early stages accurately, reliably, and in a faster way so that human life can be saved before reaching its critical stage. Many researchers have proposed solutions using a machine learning approach, but need improvement in terms of accuracy and other QoS parameters. Hence, we have proposed two layers of Stacking Ensemble Model (level 0 and level 1) for heart disease prediction that will divide the dataset based on age and gender. From the input training dataset, level 0 models gets trained and the output of this model works as an input for the level 1 model to perform prediction. The experimental results demonstrate that the proposed Stacked Ensemble Model improved accuracy …",
      "url": "https://link.springer.com/chapter/10.1007/978-3-031-56818-3_7",
      "citationUrl": ""
    },
    {
      "title": "CRLSTM-HEXNET: Hybrid Deep Learning Framework with Harris Hawk Optimization in Multi-Label Classification",
      "year": "",
      "authors": "Monia Digra and Renu Dhir and Nonita Sharma",
      "citations": 0,
      "journal": "International Journal of Image and Graphics",
      "abstract": "Deep learning has enabled significant advancements in the classification of remote sensing images; however, the task of classifying images in remote sensing remains a formidable challenge because of the high item diversity and complexity that result from spatial and temporal combination and connection. The problem of insufficient differentiation of feature representations generated by deep learning remains, which is mostly due to the similarity and variety of inter-class and intra-class images, respectively. This paper introduces a novel hexagonal network architecture called DenseNet-169, which is based on end-to-end convolutional methods (Bi-LSTM and RNN model) known as CRLSTM-Hexnet. The proposed model comprises three distinct components: (1) a module for extracting features, (2) a feature selection module utilizing the Harris Hawk optimization (HHO) algorithm, and (3) a sub-network based on …",
      "url": "https://www.worldscientific.com/doi/abs/10.1142/S021946782650004X",
      "citationUrl": ""
    },
    {
      "title": "Digital Healthcare System Using Stacked Ensemble Machine Learning Model",
      "year": "",
      "authors": "Saurabh Verma and Renu Dhir and Mohit Kumar and Mansi Gupta",
      "citations": 0,
      "journal": "DATA SCIENCE AND ARTIFICIAL INTELLIGENCE FOR DIGITAL HEALTHCARE",
      "abstract": "The crucial organ of the human body is heart, which is responsible for supplying the blood to each and every organ of our body. Accidentally if it stops functioning perfectly, then the brain and numerous other organs will cease to function, and the individual will die within a few minutes. Nowadays, cardiovascular disease is increasing alarmingly due to stress, hypertension, bad food habits, smoking, and a high intake of alcohol. These, together, contribute to several heart-related diseases. Heart diseases have risen to become one of the root causes of death around the globe, affecting people all over the world. Due to cardiovascular disease, approximately 17.7 million die annually in the United States, as reported by World Health Organization (WHO), making up 31% of all fatalities globally [1]. Similar to the United States, in India, heart disease has risen to be the main reason of death. In India, heart disease had killed more than 2.1 million people in 2015, impacting people of all ages, according to research. Stroke caused 0.4 million fatalities (28%) and coronary heart disease caused 0.9 million deaths (68.4%) of the 1.3 million cardiovascular deaths among adults aged 30–69 [2]. According to the experts, there are more risk factors connected with developing heart disease among young individuals in India as a result of irregular diets, obesity, hypertension, high-stress factors, and smoking, all of which are contributing causes [3, 4]. Cardiovascular",
      "url": "https://books.google.com/books?hl=en&lr=&id=c14cEQAAQBAJ&oi=fnd&pg=PA109&dq=info:olDv_Tw_m-8J:scholar.google.com&ots=Q_NEHPm2sJ&sig=E65EMZ_c5uAKM0qjSaz1UHK6XpM",
      "citationUrl": ""
    },
    {
      "title": "Crop Classification Using Deep Learning on Time Series SAR Images: A Survey",
      "year": "",
      "authors": "Naman Saini and Renu Dhir and Kamalpreet Kaur",
      "citations": 0,
      "journal": "",
      "abstract": "Synthetic aperture radar (SAR) images are an advanced alternative to all other traditional methods because they can collect data on soil moisture and crop structure while also penetrating clouds. Over the past 10 years, crop classification using a variety of deep learning techniques using time series data of SAR images has become an active research area. Deep learning models have been widely adopted for crop classification on this data. In this approach, the temporal information of SAR images over a certain period is exploited to capture the dynamic changes of crop growth stages. Various deep learning models have been proposed for crop classification on SAR image data, including transformers, convolutional neural network (CNN), and recurrent neural network (RNN). The performances of these models have been evaluated using different SAR datasets, such as ALOS PALSAR, RADARSAT-2, and Sentinel-1 …",
      "url": "https://link.springer.com/chapter/10.1007/978-981-99-7814-4_1",
      "citationUrl": ""
    },
    {
      "title": "PCD-Predicting the Coronavirus using Deep Learning Techniques",
      "year": "",
      "authors": "Kamalpreet Kaur and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "Since the coronavirus disease of 2019 (COVID-19) has spread so quickly, predicting its fatality and recovery rates is challenging. This research analyses the occurrence of COVID-19 diffusion throughout the world. Using real-world datasets, an artificial intelligence (AI) based method is proposed to discover positive cases of COVID19 patients, mortality, and recovery rates. To accurately forecast the virus, deep learning provides a means of battling the coronavirus pandemic.",
      "url": "https://ieeexplore.ieee.org/abstract/document/10176492/",
      "citationUrl": ""
    },
    {
      "title": "A study of machine learning techniques for Automated Karyotyping System",
      "year": "",
      "authors": "Kamalpreet Kaur and Renu Dhir",
      "citations": 0,
      "journal": "bioRxiv",
      "abstract": "Genetic abnormalities constitute a considerable share of all the existing societal healthcare issues. There has been a dire need for the automation of chromosomal analysis, hence supporting laboratory workers in effective classification and identifying such abnormalities. Nevertheless, many modern image processing techniques, like karyotyping, have improved the life expectancy and quality of life of such cases. The standard image-based analysis procedures include pre-processing, segmentation, feature extraction, and classification of images. When explicitly considering karyotyping, the processes of segmentation and classification of chromosomes have been the most complex, with much existing literature focusing on the same. Various model-based machine learning models have proven to be highly effective in solving existing issues and building an artificial intelligence-based, autonomous-centric karyotyping system. An autonomous karyotyping system will connect the pre-processing, segmentation, and classification of metaphase images. The review focuses on machine-learning-based algorithms for efficient classification accuracy. The study has the sole motive of moving towards an effective classification method for karyotype metaphase images, which will eventually predict the fetus's abnormalities more effectively. The study's results will benefit future researchers working in this area.",
      "url": "https://www.biorxiv.org/content/10.1101/2023.11.16.567473.abstract",
      "citationUrl": ""
    },
    {
      "title": "Innovations in Multimedia Information Processing & Retrieval",
      "year": "",
      "authors": "Tanvi Arora and Renu Dhir and Rituraj Soni",
      "citations": 0,
      "journal": "Multimedia Tools and Applications",
      "abstract": "Innovations in Multimedia Information Processing & Retrieval Page 1 EDITORIAL NOTE \nInnovations in Multimedia Information Processing & Retrieval © Springer Science+Business \nMedia, LLC, part of Springer Nature 2023 Multimedia Tools and Applications gratefully \nacknowledges the editorial work of the scholars listed below on the special issue entitled “Innovations \nin Multimedia Information Processing & Retrieval” (SI 1207). Of 86 papers submitted, 21 were \naccepted for this issue after a stringent peer review process. Corresponding Guest Editor Tanvi \nArora CGC-College of Engineering, Landran, Punjab, India Email: tanvi.coecse@cgc.edu.in \nGuest Editors Renu Dhir Dr. BR Ambedkar National Institute of Technology, Jalandhar, Punjab, \nIndia Email: dhirr@nitj.ac.in Rituraj Soni Engineering College Bikaner, Rajasthan, India \nEmail: riturajsoni@ecb.ac.in Publisher’s note Springer Nature remains neutral with regard …",
      "url": "https://link.springer.com/article/10.1007/s11042-023-14903-2",
      "citationUrl": ""
    },
    {
      "title": "Regression-based software fault prediction using biogeography-based optimisation (R-BBO)",
      "year": "",
      "authors": "Aarti and Geeta Sikka and Renu Dhir",
      "citations": 0,
      "journal": "International Journal of Intelligent Systems Design and Computing",
      "abstract": "It is difficult to build model of accurate estimate due to the inherent uncertainty and similarity among different categories in development projects. In this paper, fault prediction is done using biogeography-based optimisation (BBO) with the goal of recognising the faults in software systems in more efficient way. Our methodology includes four steps as follows: 1) firstly pre-processing was employed to remove redundant data; 2) secondly, relevant features are extracted using principal component analysis; 3) thirdly, fault-prediction system based on the optimisation of regression parameter using biogeography-based optimisation (R-BBO) was proposed. The experiment employed over different fault related datasets using ten-fold cross validation. The results showed that proposed prediction system (R-BBO) yield an overall accuracy of 85.4% (predicted over five datasets) which is higher than the prediction using genetic …",
      "url": "https://www.inderscienceonline.com/doi/abs/10.1504/IJISDC.2019.105803",
      "citationUrl": ""
    },
    {
      "title": "Hexagonal Descriptor Particle Swarm Optimization with Knowledge-Crowding for Face Recognition",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 0,
      "journal": "International Journal of Signal Processing, Image Processing and Pattern Recognition",
      "abstract": "Automatic identification of various facial expressions with high recognition value is important for human computer interaction as the facial behavior of a human can be treated as an important factor for information representation as well as communication. A number of basic factors such as cluttered background, occlusion, and camera movement and illumination variations degrade the image quality resulting in poor performance for identifying different facial expressions. Moreover the identification of the automatic feature detection in facial behavior requires high degree of correlation between the training and test images. Face recognition is done by minimizing the objective function which leads to selection of optimal set of fiducial points. The method preserves the local information from different facial views for mapping neighboring input to its corresponding output, resulting in low dimensional representation for …",
      "url": "https://www.earticle.net/Article/A284981",
      "citationUrl": ""
    },
    {
      "title": "Various Parsers Available for Indian and Foreign Languages: A Survey",
      "year": "",
      "authors": "Ishan Kumar and Renu Dhir and Sanjeev Kumar Sharma",
      "citations": 0,
      "journal": "International Journal of Computer Applications & Information Technology",
      "abstract": "Parsing is one of the essential activity to analyze the sentence structure. A sentence will be parsed if it is grammatically correct ie follow the grammar rule of that particular language for which it has been designed. In many natural language processing applications such as grammar checker, question answering, summarization and machine translation etc., parser play an important role. In this research work author has provided a survey regarding various parsers developed for Indian and foreign languages. This paper addresses the various developments in parsers for Indian language, which is very essential computational linguistic tool needed for many natural language processing (NLP) applications like grammar checker and sentence structure analysis.",
      "url": "http://www.ijcait.com/IJCAIT/91/912.pdf",
      "citationUrl": ""
    },
    {
      "title": "A Novel Elliptic Curve Cryptography Based Approach of Re-watermarking for Cheque Truncation System",
      "year": "",
      "authors": "Vineet Mehan and Renu Dhir and Yadwinder Singh Brar",
      "citations": 0,
      "journal": "Journal of Discrete Mathematical Sciences and Cryptography",
      "abstract": "Cheque Truncation System (CTS) is a technique of preventing tangible movement of cheque by substituting it with a digital image, with an aim for secure and faster clearance. For the first time re-watermarking is applied for authenticating transactions in CTS. Methodology for the proposed approach splits the host image (Ih) into two layers (L). In L1 cheque details are fused with two image color channels to form a composite message (Cm). Secure hash algorithm (SHA-512) is applied to Cm to generate a unique message digest (Md). Elliptic Curve Digital Signature Algorithm (ECDSA) is applied to Md to create a digital signature. The signature is embedded by exploiting Human Visual System (HVS) color channel sensitivity in equally parted mode. In L2, joint secret is established to form key using Elliptic Curve Diffie Hellman Protocol (ECDHP). Advanced Encryption Standard (AES) is applied to user details intricate in …",
      "url": "https://www.tandfonline.com/doi/abs/10.1080/09720529.2014.894316",
      "citationUrl": ""
    },
    {
      "title": "Research Article Cryptanalysis and Performance Evaluation of Enhanced Threshold Proxy Signature Scheme Based on RSA for Known Signers",
      "year": "",
      "authors": "Raman Kumar and Harsh Kumar Verma and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "In these days there are plenty of signature schemes such as the (t, n) threshold proxy signature scheme (Kumar and Verma 2010). The network is a shared medium so that the weakness security attacks such as eavesdropping, replay attack, and modification attack. Thus, we have to establish a common key for encrypting/decrypting our communications over an insecure network. In this scheme, a (t, n) threshold proxy signature scheme based on RSA, any t or more proxy signers can cooperatively generate a proxy signature while t− 1 or fewer of them cannot do it. The threshold proxy signature scheme uses the RSA cryptosystem to generate the private and the public key of the signers (Rivest et al., 1978). Comparison is done on the basis of time complexity, space complexity, and communication overhead. We compare the performance of four schemes (Hwang et al.(2003), Kuo and Chen (2005), Yong-Jun et al.(2007), and Li et al.(2007), with the performance of a scheme that has been proposed earlier by the authors of this paper. In the proposed scheme, both the combiner and the secret share holder can verify the correctness of the information that they are receiving from each other. Therefore, the enhanced threshold proxy signature scheme is secure and efficient against notorious conspiracy attacks.",
      "url": "https://www.academia.edu/download/101345023/790257.pdf",
      "citationUrl": ""
    },
    {
      "title": "Multiple Perceptible Watermarking for Copyright Protection",
      "year": "",
      "authors": "V Mehan and R Dhir and YS Brar",
      "citations": 0,
      "journal": "International Journal of Computer Applications",
      "abstract": "Perceptible watermarking system is an imperative copyright protection tool for digital images. Perceptible watermarks safeguard the digital images in a better vigorous manner, then imperceptible watermarks. The paper presents a multiple perceptible watermarking approach for copyright protection. Two perceptible watermarks are embedded to the color digital images. The watermarked image comprehends noticeable but un-obstructive watermark evidence. The proposed system can be castoff for advertisement and copyright uses.",
      "url": "https://citeseerx.ist.psu.edu/document?repid=rep1&type=pdf&doi=56c2c75ae4805810e03e2d284b7a1af5ee7babec",
      "citationUrl": ""
    },
    {
      "title": "Real Time Based QoS Analysis in MANET",
      "year": "",
      "authors": "Suresh Kumar and Renu Dhir",
      "citations": 0,
      "journal": "International Journal",
      "abstract": "A mobile Ad hoc network (MANET) is a set of wireless mobile nodes that can communicate with each other without using any fixed infrastructure. It is also necessary for MANET devices to communicate in a seamless manner. There are multiple routing protocols that have been developed for MANETS. There is a need to support real time and multimedia applications in MANETs as they gain popularity. This paper focuses on performance investigation of reactive and proactive MANET routing protocols, namely AODV, TORA and OLSR. Therefore, this paper presents a performance comparison of the selected MANET routing protocols in a Real time data (voice) with increasing area and nodes size to investigate mobility and scalability of the routing process.",
      "url": "https://scholar.google.com/scholar?cluster=18167459594049980756&hl=en&oi=scholarr",
      "citationUrl": ""
    },
    {
      "title": "Research Article Bayesian and Fuzzy Approach to Assess and Predict the Maintainability of Software: A Comparative Study",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "Quality has always been one of the major issues responsible for the success of software. Maintainability is one of the characteristics of software quality. A large number of techniques were developed for the assess and predication of this characteristic. Most of these techniques do not decompose it to an actual assessment level and thus fail to give a detailed account of the impact of specific criteria. These techniques thus constrain their use as the basis for analysis quantitatively. In this paper, we develop a system based on fuzzy inference approach to assess and predict maintainability in a quantitative manner. This system is an enhancement of Bayesian approach which is using activity-based quality model to deal with maintainability. We also compare the proposed fuzzy technique with an existing Bayesian approach to depict the improvement achieved due to the advantageous accuracy of fuzzy over crisp approach.",
      "url": "https://www.academia.edu/download/46031267/202980.pdf",
      "citationUrl": ""
    },
    {
      "title": "Electronics, Information and Communication Engineering© 2011 by IJCA Journal ICEICE-Number 1 Year of Publication: 2011",
      "year": "",
      "authors": "Bhagyashree P Palnitkar and Anagha M Panditrao",
      "citations": 0,
      "journal": "",
      "abstract": "The paper proposes a novel technique for the detection of alkali metals such as sodium; potassium etc. which is carried out by the digital photographic technique. Various samples of known concentration are prepared. The samples are aspired in a flame photometer. The flame images are captured using a consumer grade digital camera of known resolution. The images",
      "url": "https://www.academia.edu/download/117405046/4253-iceice007.pdf",
      "citationUrl": ""
    },
    {
      "title": "Performance Comparision of Handwritten Devnagari Numerals Recognition",
      "year": "",
      "authors": "Mahesh Jangid and Kartar Singh and Renu Dhir and Rajneesh Rani",
      "citations": 0,
      "journal": "International Journal",
      "abstract": "",
      "url": "",
      "citationUrl": ""
    },
    {
      "title": "Theory and Methods for Character Recognition of Gurmukhi Script",
      "year": "",
      "authors": "Renu Dhir and Tarun Guide Marhwal",
      "citations": 0,
      "journal": "",
      "abstract": "Gurmukhi script is a moderately complex pattern of primitive characters their half forms, upper and lower vowel-modifier symbols and diacritical marks. The present work describes the design and implementation of a scheme for the off-line recognition of the isolated primitive characters of the Gurmukhi script. A hierachical control strategy which exploits the character stroke features of varying degree of complexity to achieve efficiency in the recognition, is used.",
      "url": "https://scholar.google.com/scholar?cluster=10978138599604949427&hl=en&oi=scholarr",
      "citationUrl": ""
    },
    {
      "title": "AUTOMATIC SEPARATION OF GURMUKHI AND ROMAN",
      "year": "",
      "authors": "GS Lehal and Chandan Singh and Renu Dhir",
      "citations": 0,
      "journal": "International Conference on Pattern Recognition",
      "abstract": "Roman script words are now commonly being used in Gurmukhi script documents. An OCR developed for the Gurmukhi script will wrongly recognize these words in Roman script. So it is necessary to filter out these Roman script words before feeding the Gurmukhi script words to the OCR. This gives rise to the need for developing an automatic script recognition system for words in Gurmukhi and Roman scripts. In this paper we have presented one such automatic script identification system. The features used in the system have been developed after close study of structural features of Gurmukhi and Roman script characters and words and designed to work for single characters, short and long words as well. At the word level the features include presence of headline, bottom projection profile and inter character gap while at the character level the features include presence of a side bar in a character, absence of any …",
      "url": "https://scholar.google.com/scholar?cluster=17257499544306340870&hl=en&oi=scholarr",
      "citationUrl": ""
    },
    {
      "title": "Follow up of acute gonococcal urethritis in males treated with norfloxacin",
      "year": "",
      "authors": "KVR Chari and MA Tutakne and R Dhir",
      "citations": 0,
      "journal": "Indian Journal of Dermatology, Venereology and Leprology",
      "abstract": "This subject was undertaken to confirm the efficacy of norfloxacin in acute gonorrhoea and to note the relapse if any during the follow up period of 3 months. 27 male patients suffering from acute gonorrhoea were treated with 800 mgs of norfloxacin as single oral dose. In all cases, gonococci disappeared from urethral smears by 8 hours, urethral discharge subsided by 72 hrs, urine on naked eye examination cleared in 4 days except in 1 case and burning micturition subsided by 7 days. Cure rate was 100% in the study. No relapse was found at the end of follow up of 3 months. No adverse reactions were observed to norfloxacin except headache in 2 cases. Norfloxacin was safe and effective in the treatment of acute gonorrhoea.",
      "url": "https://ijdvl.com/article?issn=0378-6323;year=1994;volume=60;issue=2;spage=76;epage=78;aulast=Chari;type=0",
      "citationUrl": ""
    },
    {
      "title": "Bilateral identical epiphyseal injury of the lower end of radius due to an unusual mechanism of injury (a case report).",
      "year": "",
      "authors": "BA Bhama and RS Dhir",
      "citations": 0,
      "journal": "Journal of postgraduate medicine",
      "abstract": "Bilateral identical epiphyseal injury of the lower end of ra... : Journal of Postgraduate Medicine \nBilateral identical epiphyseal injury of the lower end of radius due to an unusual mechanism \nof injury (a case report). : Journal of Postgraduate Medicine Log in or Register Get new issue \nalertsGet alerts Submit a Manuscript Secondary Logo Journal Logo Advanced Search Toggle \nnavigation Register Login HomeCurrently selected Current Issue Previous Issues For Authors \nPublished Ahead-of-Print Journal Info Advanced Search Apr-Jun 1988 - Volume 34 - Issue 2 \nPrevious Article Article Bilateral identical epiphyseal injury of the lower end of radius due to \nan unusual mechanism of injury (a case report). Bhama, BA; Dhir, RS Journal of Postgraduate \nMedicine 34(2):p 122-123, Apr–Jun 1988. Open F1-16 Figure © 1988 Journal of \nPostgraduate Medicine | Published by Wolters Kluwer – Medknow View full article text Article …",
      "url": "https://journals.lww.com/jopm/fulltext/1988/34020/bilateral_identical_epiphyseal_injury_of_the_lower.16.aspx",
      "citationUrl": ""
    },
    {
      "title": "ERROR RATE ANALYSIS FOR RECOGNITION OF BILINGUAL CHARACTERS (GURMUKHI AND ROMAN)",
      "year": "",
      "authors": "Renu Dhir",
      "citations": 0,
      "journal": "International Journal of Computing and Mathematical Applications",
      "abstract": "Recognition of bilingual script or characters in an image of a document page is of primary importance for a system processing bilingual document. In this paper two essential sub stages of recognition phase, feature extraction and classification has been discussed for segmented Gurmukhi and Roman characters. Structural and Statistical features have been proposed for machine printed bilingual characters. Three classifiers such as k-nearest neighbor (KNN), artificial neural networks (ANN) and Support Vector Machines (SVM) schemes have been proposed for analyzing the error rate for recognition. It has been found that error rate is dropped when statistical features are used simultaneously with structural features. It has also been observed that SVM outperform among all the classifiers and error rate is very low with this classifier.",
      "url": "https://scholar.google.com/scholar?cluster=14777491123552933801&hl=en&oi=scholarr",
      "citationUrl": ""
    },
    {
      "title": "International Journal of Education and Management Engineering (IJEME)",
      "year": "",
      "authors": "Wenfeng Liu",
      "citations": 0,
      "journal": "",
      "abstract": "Early in 2008, it was emphasized that sending messages through public networks will draw the attention of third parties such as attackers, perhaps causing attempts to break and reveal messages. Thus, cryptography was initially used to send a text message by producing cipher text. Although cryptography provides confidentiality for sent message, but the cipher text that is generated appears nonsense for the attacker, which leads to being identified as the sensitive information. In order to overcome this problem, this paper introduces a novel mobile steganography technique, based on using emoticons to deliver sensitive information as a daily emotion monitoring application. Based on achieved result, 88 characters can be embedded and sent to the recipient successfully in a hidden way.",
      "url": "https://scholar.google.com/scholar?cluster=7055379657704247781&hl=en&oi=scholarr",
      "citationUrl": ""
    },
    {
      "title": "Image Compression Using Fast 2-D DCT",
      "year": "",
      "authors": "Anjali Kapoor and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "Image Compression is a method, which reduces the size of the data to reduce the amount of space required to store the data. The Discrete cosine transform (DCT) is a method for transforms a signal or image from spatial domain to frequency component. It is a widely used technique in image compression. In this paper, we present a lossless discrete cosine transform (DCT) compression technique for two-dimensional images are proposed. In the several scenarios, the utilization of the proposed technique for image compression resulted in comparable or better performance, when compared to the different modes of the lossless JPEG standard.",
      "url": "https://www.academia.edu/download/111085165/IJCSE11-03-06-090.pdf",
      "citationUrl": ""
    },
    {
      "title": "Bandwidth Delay Quality Parameter Based Multicast Congestion Control",
      "year": "",
      "authors": "Manisha Manjul and Renu Dhir and Karan Singh",
      "citations": 0,
      "journal": "",
      "abstract": "Computer Network is a most used phenomenon for digital information world. Computer network have the various problem due to more demand such as congestion control security, reliability, scalability, fairness, etc. Multicast service help the computer network to flow information from one end to another end. Multicast service also has the big problem due to more data demands of receivers known as congestion. There are various multicast congestion control scheme such as RLM, PLM, RLC, FLID/DL and BDP. In this paper, we are going to produce idea to find out better data quality for receivers using modified congestion control scheme known as Bandwidth Delay Quality Parameter (BDQP) in Based On Delay Parameter (BDP). BDQP Congestion Control Scheme minimizes the congestion and provides better network performance to provide more quality data.",
      "url": "https://www.researchgate.net/profile/Renu-Dhir/publication/228893740_Bandwidth_Delay_Quality_Parameter_Based_Multicast_Congestion_Control/links/55dd468a08ae591b309acbfc/Bandwidth-Delay-Quality-Parameter-Based-Multicast-Congestion-Control.pdf",
      "citationUrl": ""
    },
    {
      "title": "A Structural Feature based approach for script identification of Gurmukhi and Roman characters and words",
      "year": "",
      "authors": "Gurpreet Singh Lehal and Chandan Singh and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "Roman script words are now commonly being used in Gurmukhi script documents. An OCR developed for the Gurmukhi script will wrongly recognize these words in Roman script. So it is necessary to filter out these Roman script words before feeding the Gurmukhi script words to the OCR. This gives rise to the need for developing an automatic script identification system for words in Gurmukhi and Roman scripts.Many researchers have developed character recognizers tuned to specific applications, but multilingual capability has not received much attention. The capability of recognizing multilingual documents is both novel and useful. Sptiz has done some pioneering work in multilingual document recogntion [1-2]. Two types of techniques are usually adopted in language differentiation [3]: token matching [4] and statistical analysis [1]. Usually the first method is used to identify the specific language of a document, while the second method is used for gross classification. Most of these papers are concerned with classification of Oriental and European scripts. Pal and Chaudhury [5-6] have worked for classification of Roman and Indian language scripts. In [5], the authors have suggested a technique based on the headline property of Devanagri and Bangla script characters. This technique works well with majority of words but sometimes fails for italics or small sized words of one or two characters. Dhanya et al [7] have developed a script recognition system for Roman and Tamil scripts which performs script recognition at word level. Patil and Subbareddy [8] have described a neural network-based script identification system for Roman, Devanagri and …",
      "url": "https://www.learnpunjabi.org/pdf/A%20Structural%20Feature%20based%20approach%20for%20script%20identificatio.pdf",
      "citationUrl": ""
    },
    {
      "title": "Issues and Emerging Trends in Identity Management",
      "year": "",
      "authors": "Manish Snehi and Jyoti Snehi and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "In today‟ s digital age as companies are moving more and more amounts of important, sensitive data, information, applications, and infrastructure online there is a need to establish and maintain credentials on all the connected and disconnected systems, and grant rights or access to users. The main goal is to manage physical and logical resources and relate them to owners. Identity Management is emerging as a significant technology to help in handling the complexity of today‟ s Business companies, dealing with security in the virtualized environment, strong authentication and dealing with threats from Insiders. This paper attempts to provide direction toward some of the issues, Challenges and Trends in Identity Management. Emerging Trends in Information technology involves identity audit, automated compliance, Role lifecycle management, authorization, Information centric identity, E-SSO and strong authentication, Open ID, Infocards, CardSpace, Governance, Identity management as a service, Risk management, and Compliance Modularity.",
      "url": "https://www.academia.edu/download/68154523/Issues_and_emerging_trends_in_Identity_M20210717-1081-1cm2fkt.pdf",
      "citationUrl": ""
    },
    {
      "title": "MaCO: A Tool For Aiding Management Of Cost Overrun Of A Software Development Project",
      "year": "",
      "authors": "Kawal Jeet and Renu Dhir",
      "citations": 0,
      "journal": "",
      "abstract": "„Cost Overrun‟ is one of the major factors for the failure of a software development project. The major reason for this difficulty is poor analysis and management of risk factors. This paper aims to find out the ways to manage and predict the overrun in this cost by using Influence Diagram (ID). Two major risk factors having adverse impact on the cost are decided to be:(1) creeping user requirements (2) use of unnecessary features in the project. An integration of impacts of these factors with experts‟ opinion and with the existing databases (consisting of probability of occurrence of risk factors) helped us to create an ID based system that is capable to model the cost overrun. This system can be used by the software manager at any stage during software development..",
      "url": "https://scholar.google.com/scholar?cluster=2683546039970306757&hl=en&oi=scholarr",
      "citationUrl": ""
    },
    {
      "title": "A Spatial Domain Approach of Fingerprinting for Colored Digital Images",
      "year": "",
      "authors": "Vineet Mehan and Renu Dhir and YS Brar",
      "citations": 0,
      "journal": "",
      "abstract": "In this paper, a spatial domain approach of fingerprinting is presented for colored digital images. A semi-blind fingerprinting conveys a secure arrangement for trading of digital images. The operational significance of the digital fingerprinting system is verified and estimated. Digital fingerprint implanted doesn’t disturb the perceptible feature of the host digital image. Multi-user collusion attacks are prevented using the proposed apparoach. Variable fingerprint size and dissimilar location insertion play significant role for inhibiting attack.",
      "url": "https://www.academia.edu/download/71304578/pdf_231.pdf",
      "citationUrl": ""
    }
  ],
  "categories": [
    "Artificial Intelligence",
    "Communication Systems",
    "Computer Science",
    "Data Science",
    "Electronics",
    "Engineering",
    "Hardware",
    "Image Processing",
    "Information Technology",
    "IoT",
    "Mathematics",
    "Networking",
    "Operating Systems",
    "Optimization",
    "Security",
    "Software Engineering"
  ]
}